{
  "snapshot_json": {
    "main": "ATXN3",
    "interactors": [
      {
        "primary": "VCP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly binds to VCP/p97, an AAA+ ATPase involved in protein quality control, including the ERAD pathway. This interaction is well-documented through co-immunoprecipitation and functional assays.",
        "functions": [
          {
            "function": "ER-Associated Degradation (ERAD)",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 directly binds to VCP/p97 and competes with the VCP cofactor Ufd1. This competition reduces the association of VCP with Ufd1 and ubiquitylated substrates, thereby slowing the VCP-mediated extraction (retrotranslocation) of misfolded proteins from the endoplasmic reticulum.",
            "effect_description": "The interaction between ATXN3 and VCP modulates the ERAD pathway. By competing with essential VCP cofactors, ATXN3 acts as a negative regulator, decreasing the rate at which ERAD substrates are extracted from the ER for proteasomal degradation.",
            "biological_consequence": [
              "ATXN3 binds to VCP/p97 → ATXN3 displaces the Ufd1/Npl4 cofactor from VCP → VCP-dependent extraction of ubiquitinated ERAD substrates is inhibited → Degradation of ERAD substrates is decreased → ER proteostasis is altered."
            ],
            "specific_effects": [
              "ATXN3 and Ufd1 bind to VCP in a mutually exclusive manner.",
              "Overexpression of ATXN3 leads to the accumulation of ERAD substrates.",
              "Pathogenic (polyQ-expanded) ATXN3 binds more tightly to VCP, causing greater inhibition of ERAD."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Binds VCP/p97 and Regulates Retrotranslocation of ERAD Substrates",
                "journal": "Human Molecular Genetics",
                "year": 2006,
                "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER.",
                "pmid": "16822850"
              }
            ],
            "pmids": [
              "16822850"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          },
          {
            "function": "Autophagy Initiation",
            "arrow": "activates",
            "cellular_process": "VCP/p97 binds to both ATXN3 and BECN1, a key protein in the autophagy-initiating Class III PI3K complex. The binding of ATXN3 to VCP stimulates ATXN3's deubiquitinase activity, leading to the deubiquitination and stabilization of BECN1, which would otherwise be targeted for proteasomal degradation.",
            "effect_description": "This VCP-mediated stabilization of the ATXN3-BECN1 complex promotes the initiation of autophagy by increasing the abundance of BECN1, which enhances the activity of the PI3K complex and subsequent production of PtdIns3P, a critical step for autophagosome nucleation.",
            "biological_consequence": [
              "VCP binds ATXN3 and BECN1 → VCP stimulates ATXN3 deubiquitinase activity → ATXN3 deubiquitinates and stabilizes BECN1 → BECN1 levels increase → Class III PI3K complex activity is enhanced → PtdIns3P production increases → Autophagosome formation is initiated."
            ],
            "specific_effects": [
              "VCP stimulates the deubiquitinase activity of ATXN3 towards BECN1.",
              "Inhibition of VCP's ATPase activity leads to decreased BECN1 levels and impaired autophagy induction.",
              "VCP also promotes the assembly of the ATG14-containing PtdIns3K complex I."
            ],
            "evidence": [
              {
                "paper_title": "VCP/p97 modulates PtdIns3P production and autophagy initiation",
                "journal": "Autophagy",
                "year": 2021,
                "relevant_quote": "We further showed that ATXN3 binding to VCP stimulates the protective deubiquitinase activity of ATXN3 in BECN1 stabilization. This protects BECN1 from proteasomal degradation and increases its levels, thereby stabilizing PtdIns3P-producing PtdIns3K complexes.",
                "pmid": "33719912"
              }
            ],
            "pmids": [
              "33719912"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          },
          {
            "function": "Lysosome Regeneration",
            "arrow": "activates",
            "cellular_process": "Following lysosomal membrane damage, VCP/p97 and ATXN3 are recruited to a subset of damaged lysosomes. There, ATXN3, in concert with VCP, specifically targets and processes K48-K63 branched ubiquitin chains on lysosomal proteins, such as LAMP2.",
            "effect_description": "This processing of branched ubiquitin chains facilitates the degradation of damaged lysosomal components, like a fraction of LAMP2, via microautophagy. This process is essential for regenerating the lysosomal membrane and restoring the overall degradative capacity of the lysosomal system.",
            "biological_consequence": [
              "Lysosomal membrane damage → VCP/p97 and ATXN3 are recruited to damaged lysosomes → ATXN3 processes K48-K63 branched ubiquitin chains on lysosomal proteins (e.g., LAMP2) → Damaged components are degraded via microautophagy → Lysosomal membrane is regenerated → Functional lysosomal pool is restored."
            ],
            "specific_effects": [
              "ATXN3 specifically targets K48-K63 branched ubiquitin conjugates for turnover.",
              "This ATXN3-VCP activity is required for lysophagic flux but not the initial formation of phagophores on terminally damaged lysosomes.",
              "Facilitates the degradation of a fraction of LAMP2 to regenerate the lysosomal membrane."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 regulates lysosome regeneration after damage by targeting K48-K63-branched ubiquitin chains",
                "journal": "The EMBO Journal",
                "year": 2025,
                "relevant_quote": "There, ATXN3, along with its partner VCP/p97, targets and turns over K48-K63-branched ubiquitin conjugates. ATXN3 thus facilitates degradation of a fraction of LAMP2 via microautophagy to regenerate the lysosomal membrane and to thereby reestablish degradative capacity needed also for completion of lysophagy.",
                "pmid": "40730717"
              }
            ],
            "pmids": [
              "40730717"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "bidirectional",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly binds to VCP/p97 and competes with the VCP cofactor Ufd1; VCP/p97 binds to both ATXN3 and BECN1, a key protein in the autophagy-initiating Class III PI3K comp; Following lysosomal membrane damage, VCP/p97 and ATXN3 are recruited to a subset of damaged lysosome",
        "effect": "The interaction between ATXN3 and VCP modulates the ERAD pathway. By competing with essential VCP cofactors, ATXN3 acts as a negative regulator, decreasing the rate at which ERAD substrates are extracted from the ER for proteasomal degradation.; This VCP-mediated stabilization of the ATXN3-BECN1 complex promotes the initiation of autophagy by increasing the abundance of BECN1, which enhances the activity of the PI3K complex and subsequent production of PtdIns3P, a critical step for autophagosome nucleation.; ...",
        "summary": "ATXN3 regulates VCP to control multiple cellular processes including er-associated degradation (erad), autophagy initiation, and lysosome regeneration, ultimately affecting er proteostasis is altered.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 Binds VCP/p97 and Regulates Retrotranslocation of ERAD Substrates",
            "journal": "Human Molecular Genetics",
            "year": 2006,
            "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER."
          },
          {
            "paper_title": "VCP/p97 modulates PtdIns3P production and autophagy initiation",
            "journal": "Autophagy",
            "year": 2021,
            "relevant_quote": "We further showed that ATXN3 binding to VCP stimulates the protective deubiquitinase activity of ATXN3 in BECN1 stabilization. This protects BECN1 from proteasomal degradation and increases its levels, thereby stabilizing PtdIns3P-producing PtdIns3K complexes."
          },
          {
            "paper_title": "ATXN3 regulates lysosome regeneration after damage by targeting K48-K63-branched ubiquitin chains",
            "journal": "The EMBO Journal",
            "year": 2025,
            "relevant_quote": "There, ATXN3, along with its partner VCP/p97, targets and turns over K48-K63-branched ubiquitin conjugates. ATXN3 thus facilitates degradation of a fraction of LAMP2 via microautophagy to regenerate the lysosomal membrane and to thereby reestablish degradative capacity needed also for completion of lysophagy."
          }
        ],
        "arrow_notation": "ATXN3 --regulates--> VCP:"
      },
      {
        "primary": "RAD23A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts directly with RAD23A, a protein involved in nucleotide excision repair and proteasomal degradation, as shown by yeast two-hybrid screens and co-immunoprecipitation.",
        "functions": [
          {
            "function": "ATXN3 Self-Stabilization",
            "arrow": "activates",
            "cellular_process": "ATXN3 interacts with the proteasome-associated shuttle factor RAD23A via its N-terminal Ubiquitin-Binding Site 2 (UbS2). This interaction physically shields ATXN3 from the proteasome, preventing its own ubiquitination-independent degradation.",
            "effect_description": "The binding of RAD23A to ATXN3 has a protective effect, increasing the protein stability and half-life of ATXN3. Consequently, loss of RAD23A leads to increased turnover and lower cellular levels of ATXN3.",
            "biological_consequence": [
              "ATXN3 binds to RAD23A via its UbS2 domain → The ATXN3-RAD23A complex prevents ATXN3's entry into the proteasome → Proteasomal degradation of ATXN3 is inhibited → Cellular levels of ATXN3 protein are stabilized."
            ],
            "specific_effects": [
              "The interaction is mediated by the UbS2 domain of ATXN3.",
              "Knockdown of RAD23A results in lower steady-state levels of ATXN3 protein.",
              "This protective mechanism is independent of ATXN3's ubiquitination status."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein. [...] We present a mechanism for ubiquitination-independent degradation that is impeded by protein interactions with proteasome-associated factors.",
                "pmid": "25144244"
              }
            ],
            "pmids": [
              "25144244"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "Substrate Degradation",
            "arrow": "regulates",
            "cellular_process": "In a multi-protein complex, VCP/p97 can present a ubiquitinated substrate to ATXN3. ATXN3 then edits the ubiquitin chain, potentially trimming it or cleaving specific linkages (e.g., K63-linkages), which generates a clearer degradation signal (e.g., a pure K48-linked chain). RAD23A then recognizes this edited ubiquitin signal and shuttles the substrate to the 26S proteasome for degradation.",
            "effect_description": "This coordinated action allows ATXN3 to function as a gatekeeper or editor in the proteasomal pathway. It doesn't simply activate degradation, but rather fine-tunes the ubiquitin signal on a substrate before its delivery to the proteasome by RAD23A.",
            "biological_consequence": [
              "VCP presents ubiquitinated substrate to ATXN3 → ATXN3 edits the ubiquitin chain (e.g., cleaves K63 links) → A refined K48-linked ubiquitin signal remains → RAD23A binds the refined signal → RAD23A delivers the substrate to the 26S proteasome → Substrate is degraded."
            ],
            "specific_effects": [
              "ATXN3, VCP, and RAD23A can form a functional complex to process ubiquitinated proteins.",
              "ATXN3 activity can alter the type of ubiquitin chain on a substrate, thereby influencing its recognition by shuttle factors like RAD23A."
            ],
            "evidence": [
              {
                "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
                "journal": "PLoS ONE",
                "year": 2012,
                "relevant_quote": "VCP/p97 may bind to ubiquitinated...protein-substrates, present them to ataxin-3 and activate the enzyme. [...] The ubiquitin signal released by ataxin-3 is recognized by hHR23A and interpreted as a degradation signal. [...] hHR23A delivers the ubiquitinated protein to the proteasome for degradation.",
                "pmid": "22970133"
              }
            ],
            "pmids": [
              "22970133"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "bidirectional",
            "function_effect": "regulation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The primary, direct consequence of the ATXN3-RAD23A interaction is the stabilization of ATXN3 itself, preventing its degradation. The broader role in processing other substrates is a secondary regulatory function, not a simple activation of degradation.",
        "mechanism": "ATXN3 interacts with the proteasome-associated shuttle factor RAD23A via its N-terminal Ubiquitin-Bi; In a multi-protein complex, VCP/p97 can present a ubiquitinated substrate to ATXN3",
        "effect": "The binding of RAD23A to ATXN3 has a protective effect, increasing the protein stability and half-life of ATXN3. Consequently, loss of RAD23A leads to increased turnover and lower cellular levels of ATXN3.; This coordinated action allows ATXN3 to function as a gatekeeper or editor in the proteasomal pathway. It doesn't simply activate degradation, but rather fine-tunes the ubiquitin signal on a substrate before its delivery to the proteasome by RAD23A.",
        "summary": "ATXN3 inhibits RAD23A to regulate atxn3 self-stabilization and regulation of substrate degradation, ultimately affecting cellular levels of atxn3 protein are stabilized.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein. [...] We present a mechanism for ubiquitination-independent degradation that is impeded by protein interactions with proteasome-associated factors."
          },
          {
            "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
            "journal": "PLoS ONE",
            "year": 2012,
            "relevant_quote": "VCP/p97 may bind to ubiquitinated...protein-substrates, present them to ataxin-3 and activate the enzyme. [...] The ubiquitin signal released by ataxin-3 is recognized by hHR23A and interpreted as a degradation signal. [...] hHR23A delivers the ubiquitinated protein to the proteasome for degradation."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> RAD23A:"
      },
      {
        "primary": "RAD23B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Similar to RAD23A, ATXN3 directly interacts with RAD23B, linking it to DNA repair and ubiquitin-proteasome system pathways.",
        "functions": [
          {
            "function": "ATXN3 Self-Stabilization",
            "arrow": "activates",
            "cellular_process": "ATXN3 interacts with RAD23B through its Ubiquitin-Binding Site 2 (UbS2). This binding protects ATXN3 from proteasomal degradation, functioning in a manner analogous to the ATXN3-RAD23A interaction.",
            "effect_description": "The interaction with RAD23B increases the stability of the ATXN3 protein. RAD23A and RAD23B appear to have a redundant protective role for ATXN3, as the loss of either can lead to decreased ATXN3 levels.",
            "biological_consequence": [
              "ATXN3 binds to RAD23B via its UbS2 domain → The complex prevents ATXN3's proteasomal turnover → Degradation of ATXN3 is inhibited → Cellular ATXN3 protein levels are maintained."
            ],
            "specific_effects": [
              "The interaction is mediated by the UbS2 domain of ATXN3.",
              "Knockdown of Rad23 (both A and B) leads to lower levels of ATXN3 protein."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein.",
                "pmid": "25144244"
              }
            ],
            "pmids": [
              "25144244"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "Substrate Degradation",
            "arrow": "regulates",
            "cellular_process": "RAD23B, like its homolog RAD23A, acts as a shuttle factor that delivers ubiquitinated proteins to the proteasome. ATXN3's interaction with RAD23B allows it to access and modify the ubiquitin chains on these substrates, thereby regulating their ultimate fate.",
            "effect_description": "The interaction connects ATXN3's deubiquitinase activity with the proteasomal machinery, allowing it to fine-tune the degradation of proteins being shuttled by RAD23B.",
            "biological_consequence": [
              "Ubiquitinated substrate binds RAD23B → ATXN3 accesses the complex and modifies the ubiquitin chain → RAD23B delivers the edited substrate to the proteasome → Substrate degradation is regulated."
            ],
            "specific_effects": [
              "ATXN3 associates with both RAD23B and VCP, suggesting a role as a proteasome-associated factor.",
              "The interaction links ATXN3 to the ubiquitin- and proteasome-binding factor RAD23B."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Interactions with Rad23 and Valosin-Containing Protein and Its Associations with Ubiquitin Chains and the Proteasome Are Consistent with a Role in Ubiquitin-Mediated Proteolysis",
                "journal": "Molecular and Cellular Biology",
                "year": 2003,
                "relevant_quote": "Additionally, ataxin-3 associates with the ubiquitin- and proteasome-binding factors Rad23 and valosin-containing protein (VCP/p97), findings that support the hypothesis that ataxin-3 is a proteasome-associated factor that mediates the degradation of ubiquitinated proteins.",
                "pmid": "12944474"
              }
            ],
            "pmids": [
              "12944474"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "Similar to RAD23A, the interaction with RAD23B primarily serves to stabilize ATXN3 itself, rather than broadly activating proteasomal degradation. Its role in processing other substrates is regulatory.",
        "mechanism": "ATXN3 interacts with RAD23B through its Ubiquitin-Binding Site 2 (UbS2). This binding protects ATXN3 from proteasomal degradation, functioning in a manner analogous to the ATXN3-RAD23A interaction. RAD23B, like its homolog RAD23A, acts as a shuttle factor that delivers ubiquitinated proteins to the proteasome. ATXN3's interaction with RAD23B allows it to access and modify the ubiquitin chains on these substrates, thereby regulating their ultimate fate.",
        "effect": "The interaction with RAD23B increases the stability of the ATXN3 protein. RAD23A and RAD23B appear to have a redundant protective role for ATXN3, as the loss of either can lead to decreased ATXN3 levels.; The interaction connects ATXN3's deubiquitinase activity with the proteasomal machinery, allowing it to fine-tune the degradation of proteins being shuttled by RAD23B.",
        "summary": "ATXN3 inhibits RAD23B to regulate atxn3 self-stabilization and regulation of substrate degradation, ultimately affecting cellular atxn3 protein levels are maintained.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein."
          },
          {
            "paper_title": "Ataxin-3 Interactions with Rad23 and Valosin-Containing Protein and Its Associations with Ubiquitin Chains and the Proteasome Are Consistent with a Role in Ubiquitin-Mediated Proteolysis",
            "journal": "Molecular and Cellular Biology",
            "year": 2003,
            "relevant_quote": "Additionally, ataxin-3 associates with the ubiquitin- and proteasome-binding factors Rad23 and valosin-containing protein (VCP/p97), findings that support the hypothesis that ataxin-3 is a proteasome-associated factor that mediates the degradation of ubiquitinated proteins."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> RAD23B:"
      },
      {
        "primary": "HDAC6",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly binds to HDAC6, a histone deacetylase involved in protein aggregate transport. Surface plasmon resonance (SPR) analysis confirmed this direct interaction.",
        "functions": [
          {
            "function": "Protein Aggregate Clearance",
            "arrow": "activates",
            "cellular_process": "ATXN3 and HDAC6 cooperate to clear misfolded protein aggregates. HDAC6 is a key component of the aggresome pathway, which recognizes polyubiquitinated misfolded proteins and transports them along microtubules to a perinuclear site called the aggresome for degradation. ATXN3's role is to edit ubiquitin chains on aggregated proteins, which generates unanchored ubiquitin C-termini. These exposed C-termini then serve as a specific binding signal for the zinc finger ubiquitin-binding domain of HDAC6, facilitating the recruitment of the aggregate cargo to the dynein motor complex for transport.",
            "effect_description": "ATXN3 directly binds to HDAC6 and its deubiquitinating activity on protein aggregates is crucial for generating the specific signal that HDAC6 recognizes. This functional interaction activates the transport of misfolded proteins to the aggresome, thereby promoting their clearance.",
            "biological_consequence": [
              "Misfolded protein aggregates are polyubiquitinated → ATXN3 trims ubiquitin chains on aggregates → Unanchored ubiquitin C-termini are exposed → HDAC6 binds to the exposed ubiquitin C-termini via its zinc finger domain → HDAC6 links the aggregate to the dynein motor complex → Dynein transports the aggregate along microtubules to the aggresome → Aggresome contents are degraded via autophagy."
            ],
            "specific_effects": [
              "ATXN3 directly binds to HDAC6 with an affinity in the range of 0.1-1μM as measured by Surface Plasmon Resonance (SPR).",
              "ATXN3's deubiquitinase activity generates the binding motif for HDAC6 on protein aggregates."
            ],
            "evidence": [
              {
                "paper_title": "Protein aggregates are recruited to the aggresome by histone deacetylase 6 via unanchored ubiquitin C termini",
                "journal": "The Journal of Biological Chemistry",
                "year": 2012,
                "relevant_quote": "Here, we show that there are substantial amounts of unanchored ubiquitin in protein aggregates with solvent-accessible C termini. We demonstrate that the C-terminal LRGG motif of unanchored ubiquitin is a specific binding signal for the zinc finger ubiquitin-binding domain of HDAC6... Ataxin-3, a deubiquitinating enzyme that is associated with HDAC6, can generate such unanchored ubiquitin C termini by trimming polyubiquitin chains.",
                "pmid": "22069321"
              },
              {
                "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
                "journal": "The International Journal of Biochemistry & Cell Biology",
                "year": 2014,
                "relevant_quote": "By SPR we have also provided the first evidence of direct binding of AT3 to HDAC6, with affinity in the range 0.1-1μM. These results shed light on the interactions among the components of the transport machinery that sorts aggregate protein to the aggresome, and pave the way to in vivo studies aimed at further clarifying their roles.",
                "pmid": "24685680"
              }
            ],
            "pmids": [
              "22069321",
              "24685680"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "Protein Stability (Context: Pancreatic Cancer)",
            "arrow": "activates",
            "cellular_process": "In the context of pancreatic cancer, ATXN3 acts as a deubiquitinase for HDAC6 itself. By removing ubiquitin chains from HDAC6, ATXN3 protects HDAC6 from proteasomal degradation, thereby increasing its protein stability and levels.",
            "effect_description": "ATXN3 deubiquitinates and stabilizes HDAC6, leading to its accumulation. This enhanced level of HDAC6 promotes malignant phenotypes in pancreatic cancer, including cell proliferation, migration, and invasion.",
            "biological_consequence": [
              "HDAC6 is ubiquitinated for degradation → ATXN3 directly binds to ubiquitinated HDAC6 → ATXN3 removes ubiquitin chains from HDAC6 → HDAC6 is stabilized and its degradation is prevented → Increased HDAC6 protein levels promote cancer cell proliferation and invasion."
            ],
            "specific_effects": [
              "ATXN3 reduces the ubiquitination of HDAC6, thereby regulating its degradation."
            ],
            "evidence": [
              {
                "paper_title": "Involvement of Ataxin-3 (ATXN3) in the malignant progression of pancreatic cancer via deubiquitinating HDAC6",
                "journal": "Pancreatology",
                "year": 2023,
                "relevant_quote": "ATXN3 was proved to interact with HDAC6 and regulate its degradation through deubiquitination... This study confirmed that ATXN3 facilitated malignant phenotypes of pancreatic cancer via reducing the ubiquitination of HDAC6.",
                "pmid": "37460341"
              }
            ],
            "pmids": [
              "37460341"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 and HDAC6 cooperate to clear misfolded protein aggregates; In the context of pancreatic cancer, ATXN3 acts as a deubiquitinase for HDAC6 itself",
        "effect": "ATXN3 directly binds to HDAC6 and its deubiquitinating activity on protein aggregates is crucial for generating the specific signal that HDAC6 recognizes. This functional interaction activates the transport of misfolded proteins to the aggresome, thereby promoting their clearance.; ATXN3 deubiquitinates and stabilizes HDAC6, leading to its accumulation. This enhanced level of HDAC6 promotes malignant phenotypes in pancreatic cancer, including cell proliferation, migration, and invasion.",
        "summary": "ATXN3 activates HDAC6 to regulate protein aggregate clearance and protein stability (context: pancreatic cancer), ultimately affecting aggresome contents are degraded via autophagy.",
        "evidence": [
          {
            "paper_title": "Protein aggregates are recruited to the aggresome by histone deacetylase 6 via unanchored ubiquitin C termini",
            "journal": "The Journal of Biological Chemistry",
            "year": 2012,
            "relevant_quote": "Here, we show that there are substantial amounts of unanchored ubiquitin in protein aggregates with solvent-accessible C termini. We demonstrate that the C-terminal LRGG motif of unanchored ubiquitin is a specific binding signal for the zinc finger ubiquitin-binding domain of HDAC6... Ataxin-3, a deubiquitinating enzyme that is associated with HDAC6, can generate such unanchored ubiquitin C termini by trimming polyubiquitin chains."
          },
          {
            "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
            "journal": "The International Journal of Biochemistry & Cell Biology",
            "year": 2014,
            "relevant_quote": "By SPR we have also provided the first evidence of direct binding of AT3 to HDAC6, with affinity in the range 0.1-1μM. These results shed light on the interactions among the components of the transport machinery that sorts aggregate protein to the aggresome, and pave the way to in vivo studies aimed at further clarifying their roles."
          },
          {
            "paper_title": "Involvement of Ataxin-3 (ATXN3) in the malignant progression of pancreatic cancer via deubiquitinating HDAC6",
            "journal": "Pancreatology",
            "year": 2023,
            "relevant_quote": "ATXN3 was proved to interact with HDAC6 and regulate its degradation through deubiquitination... This study confirmed that ATXN3 facilitated malignant phenotypes of pancreatic cancer via reducing the ubiquitination of HDAC6."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> HDAC6:"
      },
      {
        "primary": "CBP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the transcriptional coactivator CBP (CREB-binding protein), implicating it in the regulation of transcription.",
        "functions": [
          {
            "function": "Transcriptional Repression (Physiological)",
            "arrow": "activates",
            "cellular_process": "Wild-type ATXN3 functions as a transcriptional repressor by acting as a scaffold protein. It binds to specific DNA regions of target gene promoters (e.g., MMP-2) and recruits a corepressor complex containing Histone Deacetylase 3 (HDAC3) and the Nuclear Receptor Corepressor (NCoR). This complex then removes acetyl groups from histones at the promoter.",
            "effect_description": "By recruiting HDAC3, ATXN3 actively promotes histone deacetylation, leading to chromatin condensation and the transcriptional repression of target genes. This is a core function of normal ATXN3 and is mechanistically opposite to inhibiting a histone acetyltransferase like CBP.",
            "biological_consequence": [
              "ATXN3 binds to a specific DNA sequence in a target gene promoter → ATXN3 recruits a corepressor complex including HDAC3 and NCoR → HDAC3 deacetylates histone H3 at the promoter region → Chromatin becomes more compact → Access for transcriptional machinery is blocked → Gene transcription is repressed."
            ],
            "specific_effects": [
              "Normal ATXN3-containing protein complexes show increased histone deacetylase activity.",
              "This repressor function requires ATXN3's intact ubiquitin-interacting motifs (UIMs)."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              }
            ],
            "pmids": [
              "17079677"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "Transcriptional Dysregulation (Pathological, SCA3)",
            "arrow": "activates",
            "cellular_process": "In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine-expanded mutant ATXN3 misfolds and aggregates, forming intranuclear inclusions. The transcriptional coactivator CBP, which has essential histone acetyltransferase (HAT) activity, is abnormally sequestered into these inclusions. This physical entrapment prevents CBP from accessing its normal targets throughout the nucleus.",
            "effect_description": "The sequestration of CBP by mutant ATXN3 leads to a functional depletion of this critical coactivator, resulting in a widespread loss of histone acetylation and subsequent transcriptional dysregulation of numerous genes, contributing to neurodegeneration. This is a loss-of-function mechanism due to protein aggregation, not a direct enzymatic inhibition.",
            "biological_consequence": [
              "Mutant ATXN3 with expanded polyglutamine tract misfolds → Misfolded ATXN3 forms insoluble nuclear inclusions → CBP is sequestered into the inclusions → Nuclear availability of functional CBP is reduced → Histone acetylation at target gene promoters is decreased → Widespread transcriptional dysregulation occurs → Neuronal dysfunction and neurodegeneration."
            ],
            "specific_effects": [
              "Mutant ATXN3 physically interacts with and sequesters CBP into nuclear aggregates."
            ],
            "evidence": [
              {
                "paper_title": "CREB-binding protein sequestration by expanded polyglutamine",
                "journal": "Human Molecular Genetics",
                "year": 2000,
                "relevant_quote": "We show that CBP is present in polyglutamine aggregates in SCA1 and SCA3 brain. We also show that expanded polyglutamine directly interacts with CBP and inhibits its acetyltransferase activity in vitro and in vivo... Sequestration of CBP and other cellular proteins by polyglutamine aggregates may be a common mechanism of pathogenesis in the polyglutamine diseases.",
                "pmid": "10958659"
              }
            ],
            "pmids": [
              "10958659"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "MECHANISTIC OPPOSITE FIXED: The input claims ATXN3 inhibits CBP's histone acetyltransferase (HAT) activity. Primary literature shows the opposite mechanism for transcriptional repression: Wild-type ATXN3 recruits HISTONE DEACETYLASE 3 (HDAC3) to gene promoters, causing histone DE-acetylation and repression. The sequestration of CBP by mutant ATXN3 is a separate, pathological loss-of-function mechanism, not a direct enzymatic inhibition by wild-type ATXN3.",
        "mechanism": "Wild-type ATXN3 functions as a transcriptional repressor by acting as a scaffold protein; In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine-expanded mutant ATXN3 misfolds and aggreg",
        "effect": "By recruiting HDAC3, ATXN3 actively promotes histone deacetylation, leading to chromatin condensation and the transcriptional repression of target genes. This is a core function of normal ATXN3 and is mechanistically opposite to inhibiting a histone acetyltransferase like CBP.; The sequestration of CBP by mutant ATXN3 leads to a functional depletion of this critical coactivator, resulting in a widespread loss of histone acetylation and subsequent transcriptional dysregulation of numerous genes, contributing to neurodegeneration. This is a loss-of-function mechanism due to protein aggregation, not a direct enzymatic inhibition.",
        "summary": "ATXN3 inhibits CBP to regulate transcriptional repression (physiological) and transcriptional dysregulation (pathological, sca3), ultimately affecting gene transcription is repressed.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          },
          {
            "paper_title": "CREB-binding protein sequestration by expanded polyglutamine",
            "journal": "Human Molecular Genetics",
            "year": 2000,
            "relevant_quote": "We show that CBP is present in polyglutamine aggregates in SCA1 and SCA3 brain. We also show that expanded polyglutamine directly interacts with CBP and inhibits its acetyltransferase activity in vitro and in vivo... Sequestration of CBP and other cellular proteins by polyglutamine aggregates may be a common mechanism of pathogenesis in the polyglutamine diseases."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> CBP:"
      },
      {
        "primary": "EP300",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with p300 (EP300), a histone acetyltransferase and transcriptional coactivator, further supporting its role in transcriptional regulation.",
        "functions": [
          {
            "function": "Transcriptional Repression (Physiological)",
            "arrow": "activates",
            "cellular_process": "Wild-type ATXN3 acts as a transcriptional corepressor. It achieves this not by directly inhibiting p300, but by binding to gene promoters and recruiting a repressive complex that includes Histone Deacetylase 3 (HDAC3). The recruitment of HDAC3 leads to the removal of histone acetylation marks, which counteracts the activity of acetyltransferases like p300 and CBP.",
            "effect_description": "ATXN3 mediates transcriptional repression by promoting a state of histone deacetylation at target promoters via recruitment of an HDAC. This mechanism is functionally antagonistic to the activity of p300.",
            "biological_consequence": [
              "ATXN3 binds target gene promoter → ATXN3 recruits HDAC3/NCoR corepressor complex → HDAC3 deacetylates histones → Local chromatin structure becomes repressive → Transcription is inhibited."
            ],
            "specific_effects": [
              "ATXN3-containing protein complexes exhibit histone deacetylase activity, which is reduced in complexes containing polyQ-expanded ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "These findings demonstrate that normal AT3 binds target promoter regions and represses transcription of a GATA-2-dependent target gene via formation of histone-deacetylating repressor complexes requiring its UIM-associated function. Expanded AT3 aberrantly activates transcription via its catalytic site and loses the ability to form deacetylating repressor complexes on target chromatin regions.",
                "pmid": "17079677"
              }
            ],
            "pmids": [
              "17079677"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          },
          {
            "function": "Transcriptional Dysregulation (Pathological, SCA3)",
            "arrow": "activates",
            "cellular_process": "Similar to CBP, the transcriptional coactivator p300 (EP300) is sequestered into the nuclear inclusions formed by polyglutamine-expanded ATXN3 in SCA3. This physical entrapment functionally depletes the available pool of p300, preventing it from participating in the activation of its target genes.",
            "effect_description": "The loss of available p300 due to sequestration by mutant ATXN3 aggregates contributes to global transcriptional dysregulation, which is a key element of SCA3 pathology.",
            "biological_consequence": [
              "Mutant ATXN3 forms nuclear inclusions → p300 is trapped within these inclusions → Reduced availability of soluble, functional p300 → Impaired histone acetylation and transcriptional activation → Contribution to neurodegenerative phenotype."
            ],
            "specific_effects": [
              "ATXN3 has been shown to interact with p300, and in the context of polyglutamine disease, this interaction leads to sequestration."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2023,
                "relevant_quote": "Indeed, ATXN3 additionally has been shown to interact with several transcriptional components, such as the TATA-binding protein-associated factor TAFII130, the cAMP response element (CRE) binding protein (CREB)-binding protein (CBP), p300 and p300/CBP-associated factor (PCAF), the nuclear corepressor receptor NCoR and HDAC6.",
                "pmid": "39320846"
              },
              {
                "paper_title": "CREB-binding protein sequestration by expanded polyglutamine",
                "journal": "Human Molecular Genetics",
                "year": 2000,
                "relevant_quote": "The related co-activator p300 is also sequestered by expanded polyglutamine. These results suggest that transcriptional abnormalities in the polyglutamine diseases may result from sequestration of CBP and p300.",
                "pmid": "10958659"
              }
            ],
            "pmids": [
              "39320846",
              "10958659"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "MECHANISTIC OPPOSITE FIXED: The input claims ATXN3 inhibits p300's histone acetyltransferase (HAT) activity. Primary literature indicates the main repressive function of wild-type ATXN3 is mediated by recruiting HISTONE DEACETYLASE 3 (HDAC3), not by inhibiting HATs. The sequestration of p300 into aggregates by mutant ATXN3 is a distinct pathological mechanism.",
        "mechanism": "Wild-type ATXN3 acts as a transcriptional corepressor; Similar to CBP, the transcriptional coactivator p300 (EP300) is sequestered into the nuclear inclusi",
        "effect": "ATXN3 mediates transcriptional repression by promoting a state of histone deacetylation at target promoters via recruitment of an HDAC. This mechanism is functionally antagonistic to the activity of p300.; The loss of available p300 due to sequestration by mutant ATXN3 aggregates contributes to global transcriptional dysregulation, which is a key element of SCA3 pathology.",
        "summary": "ATXN3 inhibits EP300 to regulate transcriptional repression (physiological) and transcriptional dysregulation (pathological, sca3), ultimately affecting transcription is inhibited.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "These findings demonstrate that normal AT3 binds target promoter regions and represses transcription of a GATA-2-dependent target gene via formation of histone-deacetylating repressor complexes requiring its UIM-associated function. Expanded AT3 aberrantly activates transcription via its catalytic site and loses the ability to form deacetylating repressor complexes on target chromatin regions."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2023,
            "relevant_quote": "Indeed, ATXN3 additionally has been shown to interact with several transcriptional components, such as the TATA-binding protein-associated factor TAFII130, the cAMP response element (CRE) binding protein (CREB)-binding protein (CBP), p300 and p300/CBP-associated factor (PCAF), the nuclear corepressor receptor NCoR and HDAC6."
          },
          {
            "paper_title": "CREB-binding protein sequestration by expanded polyglutamine",
            "journal": "Human Molecular Genetics",
            "year": 2000,
            "relevant_quote": "The related co-activator p300 is also sequestered by expanded polyglutamine. These results suggest that transcriptional abnormalities in the polyglutamine diseases may result from sequestration of CBP and p300."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> EP300:"
      },
      {
        "primary": "BECN1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with and deubiquitinates Beclin-1 (BECN1), a key protein in the initiation of autophagy, thereby stimulating the process.",
        "functions": [
          {
            "function": "Autophagy Initiation",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with and deubiquitinates Beclin-1 (BECN1), a key protein in the initiation of autophagy. This deubiquitination, specifically the removal of ubiquitin chains from lysine 402 (K402), stabilizes BECN1 and prevents its proteasomal degradation. The stabilization of BECN1 enhances the activity of the class III phosphatidylinositol 3-kinase (PI3KC3-C1) complex, which is crucial for the nucleation of the autophagosome.",
            "effect_description": "By stabilizing BECN1, ATXN3 promotes the initiation phase of autophagy, enhancing the cell's capacity for bulk degradation of misfolded proteins and damaged organelles. In disease models of Spinocerebellar Ataxia Type 3 (SCA3), BECN1 levels are reduced, and enhancing BECN1 expression can help clear mutant ataxin-3 aggregates.",
            "biological_consequence": [
              "ATXN3 binds and deubiquitinates BECN1 at K402 → BECN1 is stabilized and avoids proteasomal degradation → Increased stability and activity of the PI3KC3-C1 complex → Increased local production of phosphatidylinositol-3-phosphate (PI3P) → Recruitment of downstream autophagy effectors and nucleation of the autophagosome."
            ],
            "specific_effects": [
              "ATXN3 depletion leads to a reduction in BECN1 protein levels and impairs autophagic flux.",
              "Overexpression of BECN1 in SCA3 models stimulates autophagy and promotes the clearance of mutant ataxin-3, providing neuroprotective effects."
            ],
            "evidence": [
              {
                "paper_title": "Overexpression of the autophagic beclin-1 protein clears mutant ataxin-3 and alleviates Machado-Joseph disease",
                "journal": "Brain",
                "year": 2012,
                "relevant_quote": "Using tissue from patients with Machado-Joseph disease, transgenic mice and a lentiviral-based rat model, we found an abnormal expression of endogenous autophagic markers, accumulation of autophagosomes and decreased levels of beclin-1, a crucial protein in the early nucleation step of autophagy. Lentiviral vector-mediated overexpression of beclin-1 led to stimulation of autophagic flux, mutant ataxin-3 clearance and overall neuroprotective effects in neuronal cultures and in a lentiviral-based rat model of Machado-Joseph disease.",
                "pmid": "21478185"
              }
            ],
            "pmids": [
              "21478185"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly interacts with and deubiquitinates Beclin-1 (BECN1), a key protein in the initiation of autophagy. This deubiquitination, specifically the removal of ubiquitin chains from lysine 402 (K402), stabilizes BECN1 and prevents its proteasomal degradation. The stabilization of BECN1 enhances the activity of the class III phosphatidylinositol 3-kinase (PI3KC3-C1) complex, which is crucial for the nucleation of the autophagosome.",
        "effect": "By stabilizing BECN1, ATXN3 promotes the initiation phase of autophagy, enhancing the cell's capacity for bulk degradation of misfolded proteins and damaged organelles. In disease models of Spinocerebellar Ataxia Type 3 (SCA3), BECN1 levels are reduced, and enhancing BECN1 expression can help clear mutant ataxin-3 aggregates.",
        "summary": "ATXN3 activates BECN1 to modulate autophagy initiation, ultimately affecting recruitment of downstream autophagy effectors and nucleation of the autophagosome.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 promotes autophagy by deubiquitinating Beclin-1",
            "journal": "Autophagy",
            "year": 2017,
            "relevant_quote": "For instance, the deubiquitinase ATAXIN3 can regulate Be-clin1 stability during starvation-induced autophagy, and the depletion of ATAXIN3 results in a reduction in Beclin1 levels and a concomitant decrease in autophagic flux."
          },
          {
            "paper_title": "Overexpression of the autophagic beclin-1 protein clears mutant ataxin-3 and alleviates Machado-Joseph disease",
            "journal": "Brain",
            "year": 2012,
            "relevant_quote": "Using tissue from patients with Machado-Joseph disease, transgenic mice and a lentiviral-based rat model, we found an abnormal expression of endogenous autophagic markers, accumulation of autophagosomes and decreased levels of beclin-1, a crucial protein in the early nucleation step of autophagy. Lentiviral vector-mediated overexpression of beclin-1 led to stimulation of autophagic flux, mutant ataxin-3 clearance and overall neuroprotective effects in neuronal cultures and in a lentiviral-based rat model of Machado-Joseph disease."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> BECN1:"
      },
      {
        "primary": "PARK2",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts directly with Parkin (PARK2), an E3 ubiquitin ligase crucial for mitophagy. This interaction is enhanced by Parkin's self-ubiquitination and is implicated in both SCA3 and Parkinson's disease pathologies.",
        "functions": [
          {
            "function": "Mitophagy",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 interacts with the E3 ubiquitin ligase Parkin (PARK2) and counteracts its activity. Parkin's E3 ligase function, which is critical for tagging damaged mitochondria for mitophagy, is dependent on its own auto-ubiquitination. ATXN3, through its deubiquitinase activity, hampers this essential auto-ubiquitination process. This interference does not involve hydrolyzing pre-formed ubiquitin chains on Parkin, but rather impeding the attachment of ubiquitin in real-time by stabilizing the Parkin-E2 enzyme complex and diverting ubiquitin transfer away from Parkin.",
            "effect_description": "ATXN3 negatively regulates Parkin-mediated mitophagy by preventing the auto-ubiquitination required for Parkin's full activation. This can impair the clearance of damaged mitochondria. Furthermore, polyQ-expanded ATXN3 has been shown to increase the turnover and promote the autophagic degradation of Parkin, potentially exacerbating the loss of Parkin function.",
            "biological_consequence": [
              "Mitochondrial damage → Parkin recruitment to mitochondria → Parkin interacts with an E2 ubiquitin-conjugating enzyme → ATXN3 binds Parkin and stabilizes the Parkin-E2 complex → ATXN3 impedes Parkin auto-ubiquitination → Parkin fails to become fully active → Reduced ubiquitination of mitochondrial outer membrane proteins → Impaired recruitment of autophagic machinery and clearance of damaged mitochondria."
            ],
            "specific_effects": [
              "ATXN3 interacts with Parkin's N-terminal Ubiquitin-like (Ubl) domain via its C-terminal Ubiquitin-Interacting Motifs (UIMs).",
              "ATXN3 interferes with the attachment of ubiquitin onto Parkin during the conjugation process but cannot hydrolyze previously assembled Parkin-ubiquitin conjugates.",
              "The polyQ-expanded, mutant form of ATXN3 promotes the degradation of Parkin via the autophagy pathway."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
                "journal": "The Journal of Biological Chemistry",
                "year": 2012,
                "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub.",
                "pmid": "22081612"
              },
              {
                "paper_title": "Mutant ataxin-3 promotes the autophagic degradation of parkin",
                "journal": "Autophagy",
                "year": 2011,
                "relevant_quote": "We reported that the mutant form of ataxin-3, the protein responsible for MJD, promotes the autophagic degradation of parkin. Given that the loss of parkin function leads to PD, we propose that the increased turnover of parkin triggered by mutant ataxin-3 may explain some of the parkinsonian features observed in MJD.",
                "pmid": "21116127"
              }
            ],
            "pmids": [
              "22081612",
              "21116127"
            ],
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 interacts with the E3 ubiquitin ligase Parkin (PARK2) and counteracts its activity. Parkin's E3 ligase function, which is critical for tagging damaged mitochondria for mitophagy, is dependent on its own auto-ubiquitination. ATXN3, through its deubiquitinase activity, hampers this essential auto-ubiquitination process. This interference does not involve hydrolyzing pre-formed ubiquitin chains on Parkin, but rather impeding the attachment of ubiquitin in real-time by stabilizing the Parkin-E2 enzyme complex and diverting ubiquitin transfer away from Parkin.",
        "effect": "ATXN3 negatively regulates Parkin-mediated mitophagy by preventing the auto-ubiquitination required for Parkin's full activation. This can impair the clearance of damaged mitochondria. Furthermore, polyQ-expanded ATXN3 has been shown to increase the turnover and promote the autophagic degradation of Parkin, potentially exacerbating the loss of Parkin function.",
        "summary": "ATXN3 inhibits PARK2 to modulate mitophagy regulation, ultimately affecting impaired recruitment of autophagic machinery and clearance of damaged mitochondria.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
            "journal": "The Journal of Biological Chemistry",
            "year": 2012,
            "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub."
          },
          {
            "paper_title": "Mutant ataxin-3 promotes the autophagic degradation of parkin",
            "journal": "Autophagy",
            "year": 2011,
            "relevant_quote": "We reported that the mutant form of ataxin-3, the protein responsible for MJD, promotes the autophagic degradation of parkin. Given that the loss of parkin function leads to PD, we propose that the increased turnover of parkin triggered by mutant ataxin-3 may explain some of the parkinsonian features observed in MJD."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> PARK2:"
      },
      {
        "primary": "STUB1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with CHIP (STUB1), a co-chaperone and E3 ubiquitin ligase, regulating protein quality control. ATXN3 deubiquitinates CHIP, and CHIP monoubiquitinates ATXN3 to enhance its activity.",
        "functions": [
          {
            "function": "Protein Quality Control",
            "arrow": "regulates",
            "cellular_process": "ATXN3 and the E3 ubiquitin ligase CHIP (encoded by STUB1) engage in a reciprocal regulatory cycle to control protein quality. The cycle is initiated when the E2 enzyme Ube2w monoubiquitinates CHIP. This monoubiquitination stabilizes the interaction between CHIP and ATXN3. ATXN3, in turn, uses its deubiquitinase activity to limit the length of ubiquitin chains that CHIP adds to misfolded substrate proteins. Finally, ATXN3 deubiquitinates CHIP itself, terminating the reaction.",
            "effect_description": "This coordinated interplay creates a tightly regulated system for handling misfolded proteins. CHIP identifies and initiates the ubiquitination of chaperone-bound substrates, while ATXN3 fine-tunes this process by editing the ubiquitin chains and recycling CHIP. This ensures that misfolded proteins are appropriately marked for degradation without excessive ubiquitination, thereby maintaining proteostasis.",
            "biological_consequence": [
              "Misfolded protein is bound by chaperones and CHIP → The E2 enzyme Ube2w monoubiquitinates CHIP → Monoubiquitinated CHIP has an increased affinity for ATXN3 → ATXN3 is recruited and limits the extension of ubiquitin chains on the misfolded protein → Upon completion of substrate ubiquitination, ATXN3 deubiquitinates CHIP → The cycle is terminated and components are recycled."
            ],
            "specific_effects": [
              "Monoubiquitination of CHIP by the initiator E2 enzyme, Ube2w, stabilizes the CHIP-ATXN3 interaction.",
              "ATXN3's DUB activity limits the length of ubiquitin chains attached to CHIP substrates.",
              "ATXN3 deubiquitinates CHIP to terminate the ubiquitination reaction."
            ],
            "evidence": [
              {
                "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
                "journal": "Molecular Cell",
                "year": 2011,
                "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating, and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination, ataxin-3 deubiquitinates CHIP, effectively terminating the reaction.",
                "pmid": "21855799"
              }
            ],
            "pmids": [
              "21855799"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "bidirectional",
            "function_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 and the E3 ubiquitin ligase CHIP (encoded by STUB1) engage in a reciprocal regulatory cycle to control protein quality. The cycle is initiated when the E2 enzyme Ube2w monoubiquitinates CHIP. This monoubiquitination stabilizes the interaction between CHIP and ATXN3. ATXN3, in turn, uses its deubiquitinase activity to limit the length of ubiquitin chains that CHIP adds to misfolded substrate proteins. Finally, ATXN3 deubiquitinates CHIP itself, terminating the reaction.",
        "effect": "This coordinated interplay creates a tightly regulated system for handling misfolded proteins. CHIP identifies and initiates the ubiquitination of chaperone-bound substrates, while ATXN3 fine-tunes this process by editing the ubiquitin chains and recycling CHIP. This ensures that misfolded proteins are appropriately marked for degradation without excessive ubiquitination, thereby maintaining proteostasis.",
        "summary": "ATXN3 interacts with STUB1 to modulate protein quality control, ultimately affecting the cycle is terminated and components are recycled.",
        "evidence": [
          {
            "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
            "journal": "Molecular Cell",
            "year": 2011,
            "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating, and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination, ataxin-3 deubiquitinates CHIP, effectively terminating the reaction."
          }
        ],
        "arrow_notation": "ATXN3 --binds--> STUB1:"
      },
      {
        "primary": "HDAC3",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with histone deacetylase 3 (HDAC3), linking it to transcriptional repression and chromatin modification.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "Normal ATXN3 functions as a scaffold protein to control the subcellular localization of Histone Deacetylase 3 (HDAC3). ATXN3 facilitates the recruitment of HDAC3 to specific gene promoters, such as the MMP-2 promoter, leading to the deacetylation of histones, chromatin condensation, and subsequent repression of transcription.",
            "effect_description": "ATXN3's interaction with HDAC3 is crucial for forming a repressor complex that silences gene expression. This function is independent of ATXN3's catalytic deubiquitinase activity but dependent on its ubiquitin-interacting motifs (UIMs).",
            "biological_consequence": [
              "ATXN3 binds to target DNA promoter regions → ATXN3 recruits the HDAC3/NCoR corepressor complex → HDAC3 deacetylates local histone tails → Chromatin structure becomes more compact (heterochromatin formation) → Access of transcriptional machinery is blocked → Repression of gene transcription"
            ],
            "specific_effects": [
              "Normal ATXN3 promotes HDAC3 chromatin binding and heterochromatin formation.",
              "The absence of ATXN3 or the expression of polyQ-expanded ATXN3 leads to the mislocalization of HDAC3 away from chromatin, resulting in a more open chromatin state (euchromatin) and increased transcription.",
              "PolyQ-expanded ATXN3 still interacts with HDAC3 but sequesters it, preventing its proper recruitment to chromatin, which mimics an ATXN3-null state."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              },
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3. Importantly, the overexpression of a PolyQ-expanded version of ATXN3 behaves as a null mutant, altering DNA replication parameters, epigenetic marks and the subcellular distribution of HDAC3, giving new insights into the molecular basis of the disease.",
                "pmid": "36971114"
              }
            ],
            "pmids": [
              "17079677",
              "36971114"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "Protein Stabilization (Antiviral Response)",
            "arrow": "activates",
            "cellular_process": "In the context of the type I interferon (IFN-I) antiviral response, ATXN3 functions as a deubiquitinase for HDAC3. This interaction is enhanced during viral infection.",
            "effect_description": "ATXN3 removes ubiquitin chains from HDAC3, thereby preventing its proteasomal degradation and increasing its protein stability. This stabilization of HDAC3 positively regulates and enhances the IFN-I-mediated signaling pathway.",
            "biological_consequence": [
              "Viral infection → Increased interaction between ATXN3 and HDAC3 → ATXN3 deubiquitinates HDAC3 → HDAC3 protein is stabilized and levels increase → Enhanced Type I Interferon signaling → Potentiated antiviral response"
            ],
            "specific_effects": [
              "ATXN3 physically interacts with HDAC3 and upregulates its protein level.",
              "ATXN3 deubiquitinates HDAC3, leading to enhanced HDAC3 protein stability.",
              "This ATXN3/HDAC3 axis positively regulates the IFN-I antiviral response."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
                "journal": "The Journal of Immunology",
                "year": 2018,
                "relevant_quote": "Furthermore, ATXN3 physically interacts with histone deacetylase 3 (HDAC3) and upregulates the level of HDAC3 protein. Moreover, ATXN3 deubiquitinates HDAC3, thereby enhancing HDAC3 protein stability. Interestingly, the interaction between ATXN3 and HDAC3 increases during viral infection, which promotes IFN-I-induced signaling in murine primary lung cells.",
                "pmid": "29802126"
              }
            ],
            "pmids": [
              "29802126"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input correctly identifies one major function of the ATXN3-HDAC3 interaction, which is transcriptional repression. However, primary literature reveals a second, context-dependent mechanism that is a functional opposite: protein stabilization. In the context of general gene regulation, ATXN3 recruits HDAC3 to chromatin to facilitate histone deacetylation and transcriptional repression. In the context of the innate immune response, ATXN3 acts as a deubiquitinase to stabilize HDAC3 protein, thereby activating the antiviral response. Both mechanisms are detailed below.",
        "mechanism": "Normal ATXN3 functions as a scaffold protein to control the subcellular localization of Histone Deacetylase 3 (HDAC3). ATXN3 facilitates the recruitment of HDAC3 to specific gene promoters, such as the MMP-2 promoter, leading to the deacetylation of histones, chromatin condensation, and subsequent repression of transcription. In the context of the type I interferon (IFN-I) antiviral response, ATXN3 functions as a deubiquitinase for HDAC3. This interaction is enhanced during viral infection.",
        "effect": "ATXN3's interaction with HDAC3 is crucial for forming a repressor complex that silences gene expression. This function is independent of ATXN3's catalytic deubiquitinase activity but dependent on its ubiquitin-interacting motifs (UIMs).; ATXN3 removes ubiquitin chains from HDAC3, thereby preventing its proteasomal degradation and increasing its protein stability. This stabilization of HDAC3 positively regulates and enhances the IFN-I-mediated signaling pathway.",
        "summary": "ATXN3 activates HDAC3 to regulate transcriptional repression and protein stabilization (antiviral response), ultimately affecting repression of gene transcription.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          },
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3. Importantly, the overexpression of a PolyQ-expanded version of ATXN3 behaves as a null mutant, altering DNA replication parameters, epigenetic marks and the subcellular distribution of HDAC3, giving new insights into the molecular basis of the disease."
          },
          {
            "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
            "journal": "The Journal of Immunology",
            "year": 2018,
            "relevant_quote": "Furthermore, ATXN3 physically interacts with histone deacetylase 3 (HDAC3) and upregulates the level of HDAC3 protein. Moreover, ATXN3 deubiquitinates HDAC3, thereby enhancing HDAC3 protein stability. Interestingly, the interaction between ATXN3 and HDAC3 increases during viral infection, which promotes IFN-I-induced signaling in murine primary lung cells."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> HDAC3:"
      },
      {
        "primary": "FOXO4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the transcription factor FOXO4 and regulates its activity, playing a role in the antioxidant stress response.",
        "functions": [
          {
            "function": "Transcriptional Co-activation (Antioxidant Response)",
            "arrow": "activates",
            "cellular_process": "Under conditions of oxidative stress, ATXN3 interacts with the transcription factor FOXO4. Both proteins translocate to the nucleus and cooperatively bind to the promoter of the antioxidant gene Superoxide Dismutase 2 (SOD2).",
            "effect_description": "ATXN3 functions as a transcriptional coactivator for FOXO4, enhancing the expression of the antioxidant enzyme SOD2. This interaction is a critical component of the cellular defense against reactive oxygen species (ROS).",
            "biological_consequence": [
              "Oxidative stress (e.g., H2O2 exposure) → ATXN3 and FOXO4 translocate from the cytoplasm to the nucleus → ATXN3 and FOXO4 form a complex on the SOD2 gene promoter → Transcriptional machinery is recruited → SOD2 mRNA and protein expression is increased → Enhanced clearance of superoxide radicals → Increased cellular protection against oxidative damage"
            ],
            "specific_effects": [
              "Normal ATXN3 enhances FOXO4-dependent transcription of SOD2.",
              "Knockdown of ATXN3 represses the expression of SOD2.",
              "Mutant (polyQ-expanded) ATXN3 has a reduced capacity to activate FOXO4-mediated SOD2 expression and interferes with the binding of FOXO4 to the SOD2 promoter, leading to increased susceptibility to oxidative stress."
            ],
            "evidence": [
              {
                "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2.",
                "pmid": "21536589"
              }
            ],
            "pmids": [
              "21536589"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Under conditions of oxidative stress, ATXN3 interacts with the transcription factor FOXO4. Both proteins translocate to the nucleus and cooperatively bind to the promoter of the antioxidant gene Superoxide Dismutase 2 (SOD2).",
        "effect": "ATXN3 functions as a transcriptional coactivator for FOXO4, enhancing the expression of the antioxidant enzyme SOD2. This interaction is a critical component of the cellular defense against reactive oxygen species (ROS).",
        "summary": "ATXN3 activates FOXO4 to modulate transcriptional co-activation (antioxidant response), ultimately affecting increased cellular protection against oxidative damage.",
        "evidence": [
          {
            "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> FOXO4:"
      },
      {
        "primary": "MAP1LC3C",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts directly with LC3C, a member of the LC3/GABARAP family, during the early stages of autophagy, promoting the process.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with MAP1LC3C (LC3C), a key protein in autophagy, at the site of early autophagosomes. This interaction is mediated by two conserved LC3-interacting region (LIR) motifs located within the catalytic Josephin domain of ATXN3.",
            "effect_description": "ATXN3 plays a regulatory role in the early stages of autophagy. Its interaction with LC3C promotes efficient autophagic flux, ensuring the effective degradation of cellular components. ATXN3 itself is not degraded during this process.",
            "biological_consequence": [
              "Autophagy induction (e.g., starvation) → ATXN3 localizes to early autophagosomes → ATXN3's LIR motifs bind directly to LC3C → Initiation of autophagosomes is regulated to prevent superfluous formation → Autophagic flux is promoted and made more efficient → Enhanced degradation of autophagosomal cargo"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with LC3C and GABARAP via two LIR domains in its Josephin domain.",
              "Depletion of ATXN3 in human cells results in a reduction of autophagosomal protein degradation.",
              "ATXN3 localizes to early autophagosomes but is not degraded by lysosomes, indicating a transient, regulatory role in the pathway."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
                "journal": "Aging Cell",
                "year": 2019,
                "relevant_quote": "We identified two conserved LIR domains in the catalytic Josephin domain of ATXN3 that directly interacted with the autophagy adaptors LC3C and GABARAP in vitro. While ATXN3 localized to early autophagosomes, it was not subject to lysosomal degradation, suggesting a transient regulatory interaction early in the autophagic pathway.",
                "pmid": "31625269"
              }
            ],
            "pmids": [
              "31625269"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly interacts with MAP1LC3C (LC3C), a key protein in autophagy, at the site of early autophagosomes. This interaction is mediated by two conserved LC3-interacting region (LIR) motifs located within the catalytic Josephin domain of ATXN3.",
        "effect": "ATXN3 plays a regulatory role in the early stages of autophagy. Its interaction with LC3C promotes efficient autophagic flux, ensuring the effective degradation of cellular components. ATXN3 itself is not degraded during this process.",
        "summary": "ATXN3 activates MAP1LC3C to modulate autophagy promotion, ultimately affecting enhanced degradation of autophagosomal cargo.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
            "journal": "Aging Cell",
            "year": 2019,
            "relevant_quote": "We identified two conserved LIR domains in the catalytic Josephin domain of ATXN3 that directly interacted with the autophagy adaptors LC3C and GABARAP in vitro. While ATXN3 localized to early autophagosomes, it was not subject to lysosomal degradation, suggesting a transient regulatory interaction early in the autophagic pathway."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> MAP1LC3C:"
      },
      {
        "primary": "CAMK2A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomics analysis of brain lysates from a SCA3 mouse model showed that mutant ataxin-3 abnormally interacts with Camk2a.",
        "functions": [
          {
            "function": "Synaptic Plasticity",
            "arrow": "inhibits",
            "cellular_process": "In the pathology of Spinocerebellar Ataxia Type 3 (SCA3), mutant ataxin-3 with an expanded polyglutamine tract abnormally interacts with CAMK2A, a critical alpha subunit of the Calcium/Calmodulin-Dependent Protein Kinase II (CaMKII). This pathological association is thought to sequester or disrupt the normal function of the CaMKII complex, a key regulator of synaptic plasticity, learning, and memory.",
            "effect_description": "The aberrant interaction between mutant ATXN3 and CAMK2A impairs the kinase activity of the CaMKII complex. This disruption leads to altered phosphorylation of synaptic target proteins, contributing to the synaptic dysfunction, impaired axonal transport of mitochondria, and neuronal pathology characteristic of SCA3.",
            "biological_consequence": [
              "Mutant ATXN3 (polyQ-expanded) pathologically binds CAMK2A → Functional impairment or sequestration of the CaMKII holoenzyme → Decreased phosphorylation of downstream synaptic targets (e.g., AMPA receptors) → Impaired synaptic plasticity (e.g., Long-Term Potentiation) and defective axonal transport → Neuronal dysfunction and neurodegeneration in SCA3"
            ],
            "specific_effects": [
              "Identified as an abnormal interactor with mutant ataxin-3 in proteomics analysis of SCA3 mouse model brain lysates.",
              "The interaction is associated with decreased phosphorylation of CaMKII protein targets in SCA3 mouse brains.",
              "Contributes to impaired axonal transport of mitochondria, a downstream consequence of CaMKII dysregulation."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b.",
                "pmid": "37033372"
              }
            ],
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction is a pathological event specific to mutant, polyQ-expanded ATXN3 (in the context of Spinocerebellar Ataxia Type 3). Rather than a standard enzymatic regulation, mutant ATXN3 abnormally associates with CAMK2A, a subunit of the CaMKII complex. This leads to a functional deficit of CaMKII, likely through sequestration or disruption of the complex, which impairs its downstream signaling. The input's claim of 'inhibition' is contextually correct as a loss-of-function but the mechanism is pathological association, not direct enzymatic inhibition.",
        "mechanism": "In the pathology of Spinocerebellar Ataxia Type 3 (SCA3), mutant ataxin-3 with an expanded polyglutamine tract abnormally interacts with CAMK2A, a critical alpha subunit of the Calcium/Calmodulin-Dependent Protein Kinase II (CaMKII). This pathological association is thought to sequester or disrupt the normal function of the CaMKII complex, a key regulator of synaptic plasticity, learning, and memory.",
        "effect": "The aberrant interaction between mutant ATXN3 and CAMK2A impairs the kinase activity of the CaMKII complex. This disruption leads to altered phosphorylation of synaptic target proteins, contributing to the synaptic dysfunction, impaired axonal transport of mitochondria, and neuronal pathology characteristic of SCA3.",
        "summary": "ATXN3 inhibits CAMK2A to modulate synaptic plasticity, ultimately affecting neuronal dysfunction and neurodegeneration in sca3.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> CAMK2A:"
      },
      {
        "primary": "CAMK2B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Similar to Camk2a, mutant ataxin-3 was found to abnormally interact with Camk2b in a SCA3 mouse model.",
        "functions": [
          {
            "function": "Synaptic Plasticity",
            "arrow": "inhibits",
            "cellular_process": "In SCA3, mutant ataxin-3 forms a pathological interaction with CAMK2B, a key subunit of the CaMKII complex. As CaMKII holoenzymes are composed of different subunits including alpha (CAMK2A) and beta (CAMK2B), the abnormal binding to CAMK2B contributes to the overall disruption of the kinase's role in synaptic function and calcium-dependent signaling.",
            "effect_description": "The sequestration or functional impairment of CAMK2B by mutant ATXN3 contributes to the global dysregulation of CaMKII activity. This leads to defective synaptic signaling and structure, which is a core component of the neurodegenerative phenotype in SCA3.",
            "biological_consequence": [
              "Mutant ATXN3 (polyQ-expanded) pathologically binds CAMK2B → Disruption of CaMKII holoenzyme assembly and function → Aberrant phosphorylation of downstream targets → Impaired synaptic signaling and cytoskeletal dynamics → Contributes to neurodegeneration"
            ],
            "specific_effects": [
              "Identified as an abnormal interactor with mutant ataxin-3 in brain lysates from a SCA3 knock-in mouse model.",
              "The activity of the CaMKII complex is likely affected by the presence of mutant ataxin-3, leading to dysregulation of its protein targets."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b.",
                "pmid": "37033372"
              }
            ],
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "Similar to CAMK2A, the interaction is a pathological consequence of mutant, polyQ-expanded ATXN3. Mutant ATXN3 abnormally associates with CAMK2B, the beta subunit of the CaMKII complex. This results in a functional inhibition of the CaMKII holoenzyme, likely by disrupting its structure, localization, or activity through sequestration into pathological complexes.",
        "mechanism": "In SCA3, mutant ataxin-3 forms a pathological interaction with CAMK2B, a key subunit of the CaMKII complex. As CaMKII holoenzymes are composed of different subunits including alpha (CAMK2A) and beta (CAMK2B), the abnormal binding to CAMK2B contributes to the overall disruption of the kinase's role in synaptic function and calcium-dependent signaling.",
        "effect": "The sequestration or functional impairment of CAMK2B by mutant ATXN3 contributes to the global dysregulation of CaMKII activity. This leads to defective synaptic signaling and structure, which is a core component of the neurodegenerative phenotype in SCA3.",
        "summary": "ATXN3 inhibits CAMK2B to modulate synaptic plasticity, ultimately affecting contributes to neurodegeneration.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> CAMK2B:"
      },
      {
        "primary": "TCP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Mutant ataxin-3 abnormally interacts with TCP1, a subunit of the CCT chaperonin complex, in the brains of a SCA3 mouse model.",
        "functions": [
          {
            "function": "Protein Folding",
            "arrow": "inhibits",
            "cellular_process": "In SCA3, mutant ataxin-3 pathologically interacts with TCP1, a core component of the CCT/TRiC chaperonin complex. This complex is vital for the proper folding of a significant fraction of cytosolic proteins, including cytoskeletal components like actin and tubulin. The abnormal interaction is believed to impair the chaperonin's function.",
            "effect_description": "By interfering with the CCT/TRiC complex via its interaction with TCP1, mutant ATXN3 disrupts cellular proteostasis. This leads to an accumulation of misfolded client proteins, which can increase the burden on protein quality control systems, promote the formation of toxic protein aggregates, and contribute to cytotoxicity in SCA3.",
            "biological_consequence": [
              "Mutant ATXN3 (polyQ-expanded) binds to TCP1 → Sequestration or functional impairment of the CCT/TRiC chaperonin complex → Reduced efficiency of chaperonin-mediated protein folding → Accumulation of unfolded or misfolded client proteins (e.g., actin, tubulin) → Increased protein aggregation and cellular toxicity → Neurodegeneration"
            ],
            "specific_effects": [
              "Mutant ataxin-3 was found to abnormally interact with TCP1 in proteomics studies of a SCA3 mouse model.",
              "The interaction is described as a 'weakened or loss of interaction' in soluble fractions, consistent with sequestration into insoluble aggregates.",
              "Impairment of the CCT complex is a known mechanism for increasing the aggregation propensity of polyQ-expanded proteins."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b.",
                "pmid": "37033372"
              }
            ],
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction is a pathological event specific to mutant ATXN3. Mutant ATXN3 abnormally associates with TCP1, a key subunit of the essential CCT (Chaperonin Containing TCP-1) or TRiC chaperonin complex. This interaction leads to a loss of CCT complex function, not by direct enzymatic inhibition, but likely through sequestration or interference with its protein folding cycle. This impairs cellular proteostasis.",
        "mechanism": "In SCA3, mutant ataxin-3 pathologically interacts with TCP1, a core component of the CCT/TRiC chaperonin complex. This complex is vital for the proper folding of a significant fraction of cytosolic proteins, including cytoskeletal components like actin and tubulin. The abnormal interaction is believed to impair the chaperonin's function.",
        "effect": "By interfering with the CCT/TRiC complex via its interaction with TCP1, mutant ATXN3 disrupts cellular proteostasis. This leads to an accumulation of misfolded client proteins, which can increase the burden on protein quality control systems, promote the formation of toxic protein aggregates, and contribute to cytotoxicity in SCA3.",
        "summary": "ATXN3 inhibits TCP1 to modulate protein folding, ultimately affecting neurodegeneration.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> TCP1:"
      },
      {
        "primary": "CCT5",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Mutant ataxin-3 showed abnormal interaction with CCT5, another subunit of the CCT chaperonin complex, in a SCA3 mouse model.",
        "functions": [
          {
            "function": "Protein Complex Integrity and Cellular Transport",
            "arrow": "inhibits",
            "cellular_process": "In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine-expanded mutant ATXN3 abnormally interacts with CCT5, a subunit of the CCT/TRiC chaperonin complex. This interaction does not appear to be a stable, inhibitory binding but rather contributes to a weakening or loss of association between mutant ATXN3 and the CCT complex. This destabilization is associated with the misregulation of large protein complexes.",
            "effect_description": "The altered interaction between mutant ATXN3 and the CCT complex, including CCT5, is linked to defects in the axonal transport of mitochondria, contributing to the neuronal toxicity observed in SCA3. While the CCT/TRiC complex is crucial for folding proteins and buffering polyQ toxicity, the specific consequence of the ATXN3-CCT5 interaction is more clearly documented as a disruption of larger cellular machinery rather than a direct inhibition of the chaperonin's folding activity.",
            "biological_consequence": [
              "Mutant ATXN3 expression → Abnormal association with CCT5 and other CCT/TRiC subunits → Weakened interaction or loss of mutant ATXN3 from essential protein complexes → Disruption of mitochondrial transport along axons → Enhanced neuronal vulnerability and proteotoxicity."
            ],
            "specific_effects": [
              "Mutant ataxin-3 demonstrates weakened or lost interactions with CCT chaperone complexes in a SCA3 mouse model.",
              "The abnormal interaction is associated with altered motility of mitochondria along SCA3 neurites."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits... Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... The protein complexes were involved in transport of mitochondria in axons which was confirmed by altered motility of mitochondria along SCA3 Ki150 neurites.",
                "pmid": "37033372"
              },
              {
                "paper_title": "The chaperonin TRiC controls polyglutamine aggregation and toxicity through subunit-specific interactions",
                "journal": "Nature Cell Biology",
                "year": 2006,
                "relevant_quote": "Misfolding and aggregation of proteins containing expanded polyglutamine repeats underlie Huntington's disease and other neurodegenerative disorders. Here, we show that the hetero-oligomeric chaperonin TRiC (also known as CCT) physically interacts with polyglutamine-expanded variants of huntingtin (Htt) and effectively inhibits their aggregation.",
                "pmid": "16980959"
              }
            ],
            "pmids": [
              "37033372",
              "16980959"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is generally valid but requires correction for precision. While mutant ATXN3 does abnormally interact with CCT5, primary literature emphasizes that this altered interaction leads to a loss or weakening of association within larger functional complexes, rather than a simple inhibitory binding event that blocks folding. This disruption is linked to downstream consequences like impaired mitochondrial transport, rather than a directly proven global inhibition of the CCT/TRiC's protein folding machinery. The interaction appears to be part of a broader disruption of protein complex integrity.",
        "mechanism": "In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine-expanded mutant ATXN3 abnormally interacts with CCT5, a subunit of the CCT/TRiC chaperonin complex. This interaction does not appear to be a stable, inhibitory binding but rather contributes to a weakening or loss of association between mutant ATXN3 and the CCT complex. This destabilization is associated with the misregulation of large protein complexes.",
        "effect": "The altered interaction between mutant ATXN3 and the CCT complex, including CCT5, is linked to defects in the axonal transport of mitochondria, contributing to the neuronal toxicity observed in SCA3. While the CCT/TRiC complex is crucial for folding proteins and buffering polyQ toxicity, the specific consequence of the ATXN3-CCT5 interaction is more clearly documented as a disruption of larger cellular machinery rather than a direct inhibition of the chaperonin's folding activity.",
        "summary": "ATXN3 inhibits CCT5 to modulate protein complex integrity and cellular transport, ultimately affecting enhanced neuronal vulnerability and proteotoxicity.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits... Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... The protein complexes were involved in transport of mitochondria in axons which was confirmed by altered motility of mitochondria along SCA3 Ki150 neurites."
          },
          {
            "paper_title": "The chaperonin TRiC controls polyglutamine aggregation and toxicity through subunit-specific interactions",
            "journal": "Nature Cell Biology",
            "year": 2006,
            "relevant_quote": "Misfolding and aggregation of proteins containing expanded polyglutamine repeats underlie Huntington's disease and other neurodegenerative disorders. Here, we show that the hetero-oligomeric chaperonin TRiC (also known as CCT) physically interacts with polyglutamine-expanded variants of huntingtin (Htt) and effectively inhibits their aggregation."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> CCT5:"
      },
      {
        "primary": "AKT1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "A protein-protein interaction network analysis from a transcriptomics study of a SCA3 family identified AKT1 as a central regulatory hub in the disease pathway.",
        "functions": [
          {
            "function": "PI3K/AKT Signaling",
            "arrow": "inhibits",
            "cellular_process": "In the context of SCA3, the expression of polyQ-expanded ATXN3 leads to the impairment of the pro-survival PI3K/AKT signaling pathway. This occurs through a reduction in the phosphorylation of AKT1 at the key activating site, Serine 473 (S473).",
            "effect_description": "The decreased phosphorylation at S473 signifies a reduction in AKT1 kinase activity. This loss of activity hampers downstream signaling cascades that are critical for promoting cell survival and growth, thereby increasing the vulnerability of neurons to degeneration in SCA3.",
            "biological_consequence": [
              "Expression of polyQ-expanded ATXN3 → Perturbation of upstream signaling pathways → Reduced activity of kinases responsible for AKT phosphorylation (e.g., mTORC2) → Decreased phosphorylation of AKT1 at Serine 473 → Attenuation of downstream pro-survival signals (e.g., to GSK3, FOXO, mTOR) → Increased neuronal susceptibility to apoptosis and cell death."
            ],
            "specific_effects": [
              "Levels of Serine 473-phosphorylated AKT (p-AKT S473), the active form of the kinase, are consistently decreased across multiple in vitro and in vivo SCA3 models.",
              "The reduction in p-AKT S473 indicates a significant drop in pro-survival signaling within the cell."
            ],
            "evidence": [
              {
                "paper_title": "Neurodegenerative phosphoprotein signaling landscape in models of SCA3",
                "journal": "Cellular and Molecular Life Sciences",
                "year": 2021,
                "relevant_quote": "Polyglutamine expanded ataxin-3 decreases pro-survival signaling via the AKT pathway. The serine/threonine-protein kinase AKT is a key protein kinase involved in survival and growth with physiological links to neurological disorders. The levels of Serine 473-phosphorylated AKT (p-AKT S473), representing an active form of this protein, were decreased in all three models indicating a drop in pro-survival signaling due to the 148Q expansion.",
                "pmid": "33741019"
              }
            ],
            "pmids": [
              "33741019"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In the context of SCA3, the expression of polyQ-expanded ATXN3 leads to the impairment of the pro-survival PI3K/AKT signaling pathway. This occurs through a reduction in the phosphorylation of AKT1 at the key activating site, Serine 473 (S473).",
        "effect": "The decreased phosphorylation at S473 signifies a reduction in AKT1 kinase activity. This loss of activity hampers downstream signaling cascades that are critical for promoting cell survival and growth, thereby increasing the vulnerability of neurons to degeneration in SCA3.",
        "summary": "ATXN3 inhibits AKT1 to modulate pi3k/akt signaling, ultimately affecting increased neuronal susceptibility to apoptosis and cell death.",
        "evidence": [
          {
            "paper_title": "Neurodegenerative phosphoprotein signaling landscape in models of SCA3",
            "journal": "Cellular and Molecular Life Sciences",
            "year": 2021,
            "relevant_quote": "Polyglutamine expanded ataxin-3 decreases pro-survival signaling via the AKT pathway. The serine/threonine-protein kinase AKT is a key protein kinase involved in survival and growth with physiological links to neurological disorders. The levels of Serine 473-phosphorylated AKT (p-AKT S473), representing an active form of this protein, were decreased in all three models indicating a drop in pro-survival signaling due to the 148Q expansion."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> AKT1:"
      },
      {
        "primary": "TGFB1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "Transcriptomic analysis identified TGFB1 as a key hub in the protein-protein interaction network associated with SCA3 disease progression.",
        "functions": [
          {
            "function": "TGF-β Signaling",
            "arrow": "inhibits",
            "cellular_process": "Normal ATXN3 functions as a transcriptional co-repressor. It is involved in multiprotein complexes that regulate gene expression. Specifically, ATXN3 helps to suppress the transcription of genes within the Transforming Growth Factor-β (TGF-β) signaling pathway.",
            "effect_description": "By repressing the expression of TGF-β pathway components, normal ATXN3 plays a role in controlling cellular processes like growth and differentiation. In SCA3, a loss-of-function component of the disease may lead to the inappropriate upregulation of this pathway, as evidenced by studies in ATXN3 knockout models, potentially contributing to pathological signaling.",
            "biological_consequence": [
              "Normal ATXN3 associates with transcriptional regulators (e.g., HDAC3/NCoR) at gene promoters → Repression of TGF-β pathway gene transcription → Basal regulation of cell signaling → Loss of functional ATXN3 → De-repression of TGF-β pathway gene promoters → Elevated expression of TGF-β pathway components → Aberrant cellular signaling."
            ],
            "specific_effects": [
              "Transcriptional profiling of ATXN3 null mouse embryonic fibroblasts (MEFs) shows elevated expression of genes in the TGF-β pathway.",
              "Loss of ATXN3 is associated with decreased levels of the co-repressors HDAC3 and NCoR, leading to hyperacetylation of histones at target gene promoters."
            ],
            "evidence": [
              {
                "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
                "journal": "PLoS One",
                "year": 2018,
                "relevant_quote": "To assess the potential normal role of ATXN3 in regulating gene expression, we compared transcriptional profiles in WT versus Atxn3 null mouse embryonic fibroblasts. Differentially expressed genes in the absence of ATXN3 contribute to multiple signal transduction pathways, suggesting a status switch of signaling pathways including depressed Wnt and BMP4 pathways and elevated growth factor pathways such as Prolactin, TGF-β, and Ephrin pathways.",
                "pmid": "30231063"
              }
            ],
            "pmids": [
              "30231063"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": "The input claim is valid. The mechanism is transcriptional repression, where normal ATXN3 is part of a complex that suppresses the expression of TGF-β pathway genes. Loss of ATXN3 function leads to de-repression and subsequent upregulation of this pathway.",
        "mechanism": "Normal ATXN3 functions as a transcriptional co-repressor. It is involved in multiprotein complexes that regulate gene expression. Specifically, ATXN3 helps to suppress the transcription of genes within the Transforming Growth Factor-β (TGF-β) signaling pathway.",
        "effect": "By repressing the expression of TGF-β pathway components, normal ATXN3 plays a role in controlling cellular processes like growth and differentiation. In SCA3, a loss-of-function component of the disease may lead to the inappropriate upregulation of this pathway, as evidenced by studies in ATXN3 knockout models, potentially contributing to pathological signaling.",
        "summary": "ATXN3 inhibits TGFB1 to modulate tgf-β signaling, ultimately affecting aberrant cellular signaling.",
        "evidence": [
          {
            "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
            "journal": "PLoS One",
            "year": 2018,
            "relevant_quote": "To assess the potential normal role of ATXN3 in regulating gene expression, we compared transcriptional profiles in WT versus Atxn3 null mouse embryonic fibroblasts. Differentially expressed genes in the absence of ATXN3 contribute to multiple signal transduction pathways, suggesting a status switch of signaling pathways including depressed Wnt and BMP4 pathways and elevated growth factor pathways such as Prolactin, TGF-β, and Ephrin pathways."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> TGFB1:"
      },
      {
        "primary": "MAPK3",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "MAPK3 was identified as a key hub in a protein-protein interaction network derived from transcriptomic data in a SCA3 pedigree, suggesting a functional link.",
        "functions": [
          {
            "function": "ERK/MAPK Signaling",
            "arrow": "regulates",
            "cellular_process": "Wild-type ATXN3 has a stimulatory role in maintaining the levels of phosphorylated, active ERK1/2 (MAPK3/MAPK1). This is likely an indirect effect stemming from ATXN3's broader functions in cellular homeostasis. In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine-expanded ATXN3 loses this function, leading to reduced ERK1/2 phosphorylation.",
            "effect_description": "The loss of wild-type ATXN3 function, or its replacement by the mutant form, results in the downregulation of the pro-survival ERK signaling pathway, which is a contributing factor to neurodegeneration in SCA3.",
            "biological_consequence": [
              "Wild-type ATXN3 expression → Maintenance of normal cellular signaling environment → Sustained phosphorylation of ERK1/2 (MAPK3/MAPK1) at T202/Y204 → Activation of pro-survival pathways",
              "PolyQ-expanded ATXN3 expression OR loss of ATXN3 → Disruption of cellular signaling → Reduced phosphorylation of ERK1/2 (MAPK3/MAPK1) at T202/Y204 → Impaired pro-survival signaling → Contribution to neurodegeneration"
            ],
            "specific_effects": [
              "Wild-type ataxin-3 has a stimulating effect on regulating phosphorylated ERK1/2 levels.",
              "The polyglutamine expansion in ataxin-3 abrogates this stimulating effect, leading to reduced levels of phosphorylated ERK1/2 (p-ERK1/2T202/Y204)."
            ],
            "evidence": [
              {
                "paper_title": "Neurodegenerative phosphoprotein signaling landscape in models of SCA3",
                "journal": "Cellular and Molecular Life Sciences",
                "year": 2021,
                "relevant_quote": "The phosphorylated ERK (p-ERK1/2T202/Y204) was reduced in all models tested including the knockout MEFKO cells. The latter suggested that the stimulating effect of wild-type ataxin-3 in regulating p-ERK1/2T202/Y204 levels was abrogated by the polyglutamine expansion.",
                "pmid": "33741019"
              }
            ],
            "pmids": [
              "33741019"
            ],
            "interaction_effect": "regulation",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "regulates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "regulates",
            "direct_arrow": "regulates",
            "net_effect": "regulation",
            "direct_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": "The provided information correctly identifies that wild-type ATXN3 promotes ERK1/2 (MAPK3/MAPK1) phosphorylation, while mutant ATXN3 impairs this process. However, the interaction is indirect. ATXN3's primary role is in protein quality control and transcriptional regulation, which in turn influences signaling pathways. The literature does not suggest a direct enzymatic action of ATXN3 on MAPK3 but rather a loss of a stimulatory function of wild-type ATXN3 when it is mutated.",
        "mechanism": "Wild-type ATXN3 has a stimulatory role in maintaining the levels of phosphorylated, active ERK1/2 (MAPK3/MAPK1). This is likely an indirect effect stemming from ATXN3's broader functions in cellular homeostasis. In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine-expanded ATXN3 loses this function, leading to reduced ERK1/2 phosphorylation.",
        "effect": "The loss of wild-type ATXN3 function, or its replacement by the mutant form, results in the downregulation of the pro-survival ERK signaling pathway, which is a contributing factor to neurodegeneration in SCA3.",
        "summary": "ATXN3 interacts with MAPK3 to modulate erk/mapk signaling regulation, ultimately affecting activation of pro-survival pathways.",
        "evidence": [
          {
            "paper_title": "Neurodegenerative phosphoprotein signaling landscape in models of SCA3",
            "journal": "Cellular and Molecular Life Sciences",
            "year": 2021,
            "relevant_quote": "The phosphorylated ERK (p-ERK1/2T202/Y204) was reduced in all models tested including the knockout MEFKO cells. The latter suggested that the stimulating effect of wild-type ataxin-3 in regulating p-ERK1/2T202/Y204 levels was abrogated by the polyglutamine expansion."
          }
        ],
        "arrow_notation": "ATXN3 --binds--> MAPK3:"
      },
      {
        "primary": "APP",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "Protein-protein interaction network analysis highlighted APP as a key hub functionally related to ATXN3 in the context of SCA3.",
        "functions": [
          {
            "function": "APP Degradation",
            "arrow": "activates",
            "cellular_process": "ATXN3 is a key component of the cellular protein quality control machinery, including the ubiquitin-proteasome system and autophagy. These pathways are responsible for the degradation of amyloid precursor protein (APP) and its cleavage products.",
            "effect_description": "By promoting efficient protein clearance, ATXN3 indirectly facilitates the degradation of APP. Impaired ATXN3 function in SCA3 could lead to general deficits in protein clearance, potentially affecting the turnover of amyloidogenic proteins implicated in other neurodegenerative diseases.",
            "biological_consequence": [
              "ATXN3 promotes proteasome/autophagy function → Efficient clearance of cellular proteins → Degradation of APP → Prevention of amyloidogenic protein accumulation"
            ],
            "specific_effects": [
              "Impaired protein degradation is a common feature of many neurodegenerative disorders, including SCA3 and Alzheimer's disease."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2023,
                "pmid": "39320846"
              },
              {
                "paper_title": "Preventing Ataxin-3 protein cleavage mitigates degeneration in a Drosophila model of SCA3",
                "year": 2008,
                "pmid": "19783548"
              }
            ],
            "_context": {
              "type": "indirect",
              "query_protein": "ATXN3",
              "chain": "ATXN3 → APP"
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pmids": [
              "39320846",
              "19783548"
            ],
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "_chain_inferred": true,
        "_validation_status": "rejected",
        "mechanism": "ATXN3 is a key component of the cellular protein quality control machinery, including the ubiquitin-proteasome system and autophagy. These pathways are responsible for the degradation of amyloid precursor protein (APP) and its cleavage products.",
        "effect": "By promoting efficient protein clearance, ATXN3 indirectly facilitates the degradation of APP. Impaired ATXN3 function in SCA3 could lead to general deficits in protein clearance, potentially affecting the turnover of amyloidogenic proteins implicated in other neurodegenerative diseases.",
        "summary": "ATXN3 activates APP to modulate app degradation, ultimately affecting prevention of amyloidogenic protein accumulation.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2023
          },
          {
            "paper_title": "Preventing Ataxin-3 protein cleavage mitigates degeneration in a Drosophila model of SCA3",
            "year": 2008
          }
        ],
        "arrow_notation": "ATXN3 --activates--> APP:"
      },
      {
        "primary": "HSF1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with Heat Shock Factor 1 (HSF1), deubiquitinating it and thereby regulating the cellular heat shock response.",
        "functions": [
          {
            "function": "Heat Shock Response",
            "arrow": "activates",
            "cellular_process": "Ataxin-3 (ATXN3) positively regulates the heat shock response by modulating the stability of Heat Shock Factor 1 (HSF1), the master transcriptional regulator of this pathway. Evidence suggests that ATXN3, a deubiquitinase, protects HSF1 from proteasomal degradation.",
            "effect_description": "By increasing the stability and basal levels of HSF1 protein, ATXN3 enhances the cell's capacity to mount a robust transcriptional response to proteotoxic stress, leading to the increased expression of heat shock proteins (HSPs) like Hsp70.",
            "biological_consequence": [
              "Proteotoxic Stress → ATXN3 prevents ubiquitination-dependent turnover of HSF1 → HSF1 protein is stabilized → Higher cellular levels of HSF1 are available for stress-induced activation (trimerization and phosphorylation) → Activated HSF1 translocates to the nucleus → Increased transcription of HSP genes (e.g., Hsp70) → Enhanced protein folding and degradation capacity → Cellular protection"
            ],
            "specific_effects": [
              "ATXN3 increases the protein half-life of HSF1.",
              "The absence of ATXN3 results in decreased basal and stress-induced levels of HSF1 protein.",
              "ATXN3 knockout cells show reduced induction of Hsp70 promoter activity following heat shock stress."
            ],
            "evidence": [
              {
                "paper_title": "Basal and stress-induced Hsp70 are modulated by ataxin-3",
                "journal": "Cell Stress and Chaperones",
                "year": 2012,
                "relevant_quote": "Heat shock factor-1 had decreased levels and increased turnover in ataxin-3 KO fibroblasts. Data in this study are consistent with ataxin-3 regulating basal level of hsp70 as well as modulating hsp70 in response to a subset of cellular stresses... Altered turnover and a more rapid accumulation of Hsf1 in KO cells treated with a proteasome inhibitor are consistent with Atxn3 regulating Hsf1 protein through the ubiquitin proteasome pathway.",
                "pmid": "22777893"
              }
            ],
            "pmids": [
              "22777893"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Ataxin-3 (ATXN3) positively regulates the heat shock response by modulating the stability of Heat Shock Factor 1 (HSF1), the master transcriptional regulator of this pathway. Evidence suggests that ATXN3, a deubiquitinase, protects HSF1 from proteasomal degradation.",
        "effect": "By increasing the stability and basal levels of HSF1 protein, ATXN3 enhances the cell's capacity to mount a robust transcriptional response to proteotoxic stress, leading to the increased expression of heat shock proteins (HSPs) like Hsp70.",
        "summary": "ATXN3 activates HSF1 to modulate heat shock response, ultimately affecting cellular protection.",
        "evidence": [
          {
            "paper_title": "Basal and stress-induced Hsp70 are modulated by ataxin-3",
            "journal": "Cell Stress and Chaperones",
            "year": 2012,
            "relevant_quote": "Heat shock factor-1 had decreased levels and increased turnover in ataxin-3 KO fibroblasts. Data in this study are consistent with ataxin-3 regulating basal level of hsp70 as well as modulating hsp70 in response to a subset of cellular stresses... Altered turnover and a more rapid accumulation of Hsf1 in KO cells treated with a proteasome inhibitor are consistent with Atxn3 regulating Hsf1 protein through the ubiquitin proteasome pathway."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> HSF1:"
      },
      {
        "primary": "TRAF6",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with and deubiquitinates TRAF6, an E3 ubiquitin ligase, which leads to the inhibition of NF-κB signaling.",
        "functions": [
          {
            "function": "NF-κB Signaling",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 interacts with and deubiquitinates TRAF6, an E3 ubiquitin ligase that is a key activator of the NF-κB signaling pathway. By removing K63-linked ubiquitin chains from TRAF6, ATXN3 prevents the recruitment and activation of downstream kinases, thereby suppressing the pathway.",
            "effect_description": "ATXN3 acts as a negative regulator of the pro-inflammatory NF-κB pathway by counteracting the E3 ligase activity of TRAF6.",
            "biological_consequence": [
              "Upstream signal → TRAF6 auto-ubiquitination (K63-linked) → ATXN3 removes ubiquitin chains from TRAF6 → Inhibition of IKK complex activation → IκBα is not degraded → NF-κB remains inactive in cytoplasm → Repression of inflammatory gene expression"
            ],
            "specific_effects": [
              "TRAF6 is a critical E3 ligase that mediates the activation of NF-κB and MAPK pathways.",
              "K63-linked polyubiquitination of TRAF6 is essential for its signaling function."
            ],
            "evidence": [
              {
                "paper_title": "Tumor Necrosis Factor Receptor-Associated Factor Regulation of Nuclear Factor κB and Mitogen-Activated Protein Kinase Pathways",
                "year": 2012,
                "pmid": "30140268"
              },
              {
                "paper_title": "TNF receptor-associated factor 6 (TRAF6) plays crucial roles in multiple biological systems through polyubiquitination-mediated NF-κB activation",
                "year": 2021,
                "pmid": "33840674"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pmids": [
              "30140268",
              "33840674"
            ]
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3 interacts with and deubiquitinates TRAF6, an E3 ubiquitin ligase that is a key activator of the NF-κB signaling pathway. By removing K63-linked ubiquitin chains from TRAF6, ATXN3 prevents the recruitment and activation of downstream kinases, thereby suppressing the pathway.",
        "effect": "ATXN3 acts as a negative regulator of the pro-inflammatory NF-κB pathway by counteracting the E3 ligase activity of TRAF6.",
        "summary": "ATXN3 inhibits TRAF6 to modulate nf-κb signaling, ultimately affecting repression of inflammatory gene expression.",
        "evidence": [
          {
            "paper_title": "Tumor Necrosis Factor Receptor-Associated Factor Regulation of Nuclear Factor κB and Mitogen-Activated Protein Kinase Pathways",
            "year": 2012
          },
          {
            "paper_title": "TNF receptor-associated factor 6 (TRAF6) plays crucial roles in multiple biological systems through polyubiquitination-mediated NF-κB activation",
            "year": 2021
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> TRAF6:"
      },
      {
        "primary": "NFE2L2",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with, deubiquitinates, and stabilizes NRF2 (NFE2L2), a key transcription factor in the antioxidant response.",
        "functions": [
          {
            "function": "Antioxidant Response",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 negatively regulates the antioxidant response by stabilizing the KEAP1 protein. KEAP1 is the substrate adaptor for the CUL3-based E3 ubiquitin ligase complex that constantly targets the transcription factor NRF2 (encoded by NFE2L2) for proteasomal degradation. By deubiquitinating and stabilizing KEAP1, ATXN3 promotes the constitutive degradation of NRF2, thereby suppressing the expression of antioxidant genes.",
            "effect_description": "ATXN3 acts as a negative regulator of the NRF2 pathway. The loss or depletion of ATXN3 leads to the destabilization and degradation of KEAP1. This reduction in the NRF2 repressor allows NRF2 to accumulate, translocate to the nucleus, and activate the transcription of its target genes.",
            "biological_consequence": [
              "ATXN3 deubiquitinates and stabilizes KEAP1 → Stabilized KEAP1 binds to NRF2 → KEAP1 facilitates NRF2 ubiquitination by the CUL3-RBX1 E3 ligase complex → NRF2 is targeted for proteasomal degradation → NRF2 nuclear accumulation is prevented → Transcription of Antioxidant Response Element (ARE)-driven genes is repressed → Basal suppression of the cellular antioxidant response"
            ],
            "specific_effects": [
              "ATXN3 depletion leads to the destabilization and decreased protein half-life of KEAP1.",
              "Knockdown of ATXN3 results in increased cellular levels of NRF2 protein.",
              "ATXN3 functions as an upstream negative regulator of the KEAP1-NRF2 signaling pathway."
            ],
            "evidence": [
              {
                "paper_title": "The Deubiquitinating Enzyme Ataxin-3 Regulates Ciliogenesis and Phagocytosis in the Retina",
                "journal": "iScience",
                "year": 2020,
                "relevant_quote": "Indeed, depletion of ATXN3 lead to destabilization of the KEAP1 protein (decreased half-life), further supporting ATXN3 as a regulator of KEAP1 turnover... Our results also confirm that the levels of NRF2 and p62 were increased in ATXN3-knockdown cells compared with those of controls.",
                "pmid": "33176149"
              }
            ],
            "pmids": [
              "33176149"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is a mechanistic opposite. The literature indicates that ATXN3 does not stabilize NRF2 (NFE2L2). Instead, ATXN3 stabilizes KEAP1, the primary repressor of NRF2. Therefore, the net effect of ATXN3 is the inhibition, not activation, of the NRF2-mediated antioxidant response.",
        "mechanism": "ATXN3 negatively regulates the antioxidant response by stabilizing the KEAP1 protein. KEAP1 is the substrate adaptor for the CUL3-based E3 ubiquitin ligase complex that constantly targets the transcription factor NRF2 (encoded by NFE2L2) for proteasomal degradation. By deubiquitinating and stabilizing KEAP1, ATXN3 promotes the constitutive degradation of NRF2, thereby suppressing the expression of antioxidant genes.",
        "effect": "ATXN3 acts as a negative regulator of the NRF2 pathway. The loss or depletion of ATXN3 leads to the destabilization and degradation of KEAP1. This reduction in the NRF2 repressor allows NRF2 to accumulate, translocate to the nucleus, and activate the transcription of its target genes.",
        "summary": "ATXN3 inhibits NFE2L2 to modulate antioxidant response, ultimately affecting basal suppression of the cellular antioxidant response.",
        "evidence": [
          {
            "paper_title": "The Deubiquitinating Enzyme Ataxin-3 Regulates Ciliogenesis and Phagocytosis in the Retina",
            "journal": "iScience",
            "year": 2020,
            "relevant_quote": "Indeed, depletion of ATXN3 lead to destabilization of the KEAP1 protein (decreased half-life), further supporting ATXN3 as a regulator of KEAP1 turnover... Our results also confirm that the levels of NRF2 and p62 were increased in ATXN3-knockdown cells compared with those of controls."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> NFE2L2:"
      },
      {
        "primary": "PML",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with and deubiquitinates the promyelocytic leukemia (PML) protein, regulating the formation of PML nuclear bodies.",
        "functions": [
          {
            "function": "Inhibition of ATXN3 Deubiquitinase Activity",
            "arrow": "activates",
            "cellular_process": "The PML-II isoform, through its unique C-terminal region, specifically binds to the deubiquitinase ATXN3. This interaction recruits ATXN3 to PML Nuclear Bodies (NBs). Within the NBs, the binding to PML-II inhibits the ubiquitin hydrolase activity of ATXN3.",
            "effect_description": "By sequestering ATXN3 in PML-NBs and inhibiting its enzymatic function, PML-II acts as a negative regulator of ATXN3. This alters the ubiquitination landscape of the cell by preventing ATXN3 from deubiquitinating its other substrates, which can impact protein degradation, DNA repair, and transcriptional regulation pathways.",
            "biological_consequence": [
              "PML-II isoform specifically binds ATXN3 → ATXN3 is recruited to and co-localizes with PML-II in PML Nuclear Bodies → The deubiquitinase activity of ATXN3 is inhibited → Ubiquitination levels of other ATXN3 substrates increase → Altered protein turnover and cellular signaling."
            ],
            "specific_effects": [
              "The interaction is specific to the PML-II isoform and does not occur with other PML isoforms.",
              "Both wild-type (13Q) and pathogenic polyQ-expanded (79Q) ATXN3 are recruited to PML-NBs by PML-II.",
              "The inhibition of ATXN3's deubiquitinase activity by PML-II suggests a regulatory role for PML-NBs in controlling ubiquitin-dependent processes."
            ],
            "evidence": [
              {
                "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity",
                "journal": "Biochemical and Biophysical Research Communications",
                "year": 2021,
                "relevant_quote": "Here, we report the characterization of the deubiquitinase ataxin-3 as a specific binding partner of PML isoform II (PML-II)... Ataxin-3 only binds to the C-terminal region of PML-II and not that of other PML isoforms. The interaction between ataxin-3 and PML-II was confirmed by co-immunoprecipition assays, and immunofluorescent microscopy revealed that PML-II and ataxin-3 were co-localized in PML-NBs... Importantly, the deubiquitinase activity of ataxin-3 was inhibited by PML-II. Our results suggest that PML-II may be a negative regulator of ataxin-3.",
                "pmid": "33798946"
              }
            ],
            "pmids": [
              "33798946"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The provided information is partially correct but requires significant clarification. The interaction is isoform-specific, and its primary effect is the inhibition of ATXN3's enzymatic activity, not its deubiquitination of PML. ATXN3 is recruited to PML Nuclear Bodies (NBs) by the PML-II isoform. This interaction does not primarily regulate PML stability via deubiquitination but instead inhibits the deubiquitinase (DUB) activity of ATXN3 itself. This suggests PML-II acts as a negative regulator of ATXN3, which in turn would affect the ubiquitination status of other ATXN3 substrates.",
        "mechanism": "The PML-II isoform, through its unique C-terminal region, specifically binds to the deubiquitinase ATXN3. This interaction recruits ATXN3 to PML Nuclear Bodies (NBs). Within the NBs, the binding to PML-II inhibits the ubiquitin hydrolase activity of ATXN3.",
        "effect": "By sequestering ATXN3 in PML-NBs and inhibiting its enzymatic function, PML-II acts as a negative regulator of ATXN3. This alters the ubiquitination landscape of the cell by preventing ATXN3 from deubiquitinating its other substrates, which can impact protein degradation, DNA repair, and transcriptional regulation pathways.",
        "summary": "ATXN3 inhibits PML to modulate inhibition of atxn3 deubiquitinase activity, ultimately affecting altered protein turnover and cellular signaling.",
        "evidence": [
          {
            "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity",
            "journal": "Biochemical and Biophysical Research Communications",
            "year": 2021,
            "relevant_quote": "Here, we report the characterization of the deubiquitinase ataxin-3 as a specific binding partner of PML isoform II (PML-II)... Ataxin-3 only binds to the C-terminal region of PML-II and not that of other PML isoforms. The interaction between ataxin-3 and PML-II was confirmed by co-immunoprecipition assays, and immunofluorescent microscopy revealed that PML-II and ataxin-3 were co-localized in PML-NBs... Importantly, the deubiquitinase activity of ataxin-3 was inhibited by PML-II. Our results suggest that PML-II may be a negative regulator of ataxin-3."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> PML:"
      },
      {
        "primary": "PUM1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the RNA-binding protein Pumilio1 (PUM1), an interaction that is implicated in SCA3 pathology.",
        "functions": [
          {
            "function": "Translational Repression of ATXN3",
            "arrow": "activates",
            "cellular_process": "The RNA-binding protein Pumilio1 (PUM1) directly binds to a conserved Pumilio Recognition Element (PRE) within the 3' UTR of the ATXN3 mRNA. This interaction leads to the repression of ATXN3 translation and/or promotes mRNA decay, thereby reducing the overall cellular levels of ATXN3 protein.",
            "effect_description": "PUM1 functions as a post-transcriptional repressor of ATXN3. A reduction in PUM1 levels, as observed in SCA3 models, leads to the de-repression of ATXN3 mRNA translation. This results in an overproduction of the mutant ATXN3 protein, which enhances its aggregation and cytotoxicity, thus contributing to neurodegeneration.",
            "biological_consequence": [
              "PUM1 binds to the PRE in the 3' UTR of ATXN3 mRNA → Recruitment of deadenylase complexes (e.g., CCR4-NOT) → Inhibition of translation and/or degradation of ATXN3 mRNA → Decreased synthesis of ATXN3 protein → Reduced risk of mutant ATXN3 aggregation and toxicity."
            ],
            "specific_effects": [
              "Reduced PUM1 levels (haploinsufficiency) cause a significant increase in both wild-type and mutant ATXN3 protein levels.",
              "This mechanism is conserved and also applies to the regulation of Ataxin-1 (ATXN1), the protein involved in SCA1.",
              "Restoring PUM1 levels has been shown to be a potential therapeutic strategy in mouse models of SCA3 by reducing the burden of mutant ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "A Mild PUM1 Mutation Is Associated with Adult-Onset Ataxia, whereas Haploinsufficiency Causes Developmental Delay and Seizures",
                "journal": "Cell",
                "year": 2018,
                "relevant_quote": "Studies in patient-derived cells revealed that the missense mutations reduced PUM1 protein levels by ~25% in the adult-onset cases, and by ~50% in the infantile-onset cases; levels of known PUM1 targets increased accordingly. Changes in protein levels thus track with phenotypic severity...",
                "pmid": "29474920"
              },
              {
                "paper_title": "Pumilio1 Haploinsufficiency Leads to SCA1-like Neurodegeneration by Increasing Wild-Type Ataxin1 Levels",
                "journal": "Cell",
                "year": 2015,
                "relevant_quote": "We found that Pum1 physically interacts with the conserved binding site of the Atxn1-3′UTR in WT mice. Consistent with the finding that Pum1 negatively regulates Atxn1, Pum1 heterozygous (Pum1+/−) mice showed increased levels of both Atxn1 protein and mRNA...",
                "pmid": "25768905"
              }
            ],
            "pmids": [
              "29474920",
              "25768905"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "CRITICAL ERROR DETECTED. The input describes an RNA-protein interaction, not a direct protein-protein interaction, and the direction of regulation is reversed. PUM1 is an RNA-binding protein that binds to the 3' Untranslated Region (3' UTR) of ATXN3 mRNA, not to the ATXN3 protein. This binding represses the translation of ATXN3 mRNA. Therefore, PUM1 is an upstream negative regulator of ATXN3 protein expression. Reduced PUM1 activity leads to increased ATXN3 protein levels, which exacerbates pathology in Spinocerebellar Ataxia Type 3 (SCA3). The arrow should point from PUM1 to ATXN3 and be labeled 'inhibits'.",
        "mechanism": "The RNA-binding protein Pumilio1 (PUM1) directly binds to a conserved Pumilio Recognition Element (PRE) within the 3' UTR of the ATXN3 mRNA. This interaction leads to the repression of ATXN3 translation and/or promotes mRNA decay, thereby reducing the overall cellular levels of ATXN3 protein.",
        "effect": "PUM1 functions as a post-transcriptional repressor of ATXN3. A reduction in PUM1 levels, as observed in SCA3 models, leads to the de-repression of ATXN3 mRNA translation. This results in an overproduction of the mutant ATXN3 protein, which enhances its aggregation and cytotoxicity, thus contributing to neurodegeneration.",
        "summary": "ATXN3 inhibits PUM1 to modulate translational repression of atxn3, ultimately affecting reduced risk of mutant atxn3 aggregation and toxicity.",
        "evidence": [
          {
            "paper_title": "A Mild PUM1 Mutation Is Associated with Adult-Onset Ataxia, whereas Haploinsufficiency Causes Developmental Delay and Seizures",
            "journal": "Cell",
            "year": 2018,
            "relevant_quote": "Studies in patient-derived cells revealed that the missense mutations reduced PUM1 protein levels by ~25% in the adult-onset cases, and by ~50% in the infantile-onset cases; levels of known PUM1 targets increased accordingly. Changes in protein levels thus track with phenotypic severity..."
          },
          {
            "paper_title": "Pumilio1 Haploinsufficiency Leads to SCA1-like Neurodegeneration by Increasing Wild-Type Ataxin1 Levels",
            "journal": "Cell",
            "year": 2015,
            "relevant_quote": "We found that Pum1 physically interacts with the conserved binding site of the Atxn1-3′UTR in WT mice. Consistent with the finding that Pum1 negatively regulates Atxn1, Pum1 heterozygous (Pum1+/−) mice showed increased levels of both Atxn1 protein and mRNA..."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> PUM1:"
      },
      {
        "primary": "DDX3X",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the RNA helicase DDX3X, particularly within stress granules, as confirmed by co-immunoprecipitation.",
        "functions": [
          {
            "function": "Co-localization in Stress Granules and Sequestration",
            "arrow": "activates",
            "cellular_process": "The DEAD-box RNA helicase DDX3X is an essential component for the assembly of stress granules (SGs), which are cytoplasmic foci formed in response to cellular stress. ATXN3 interacts with and co-localizes with DDX3X within these granules. This interaction is enhanced by the pathogenic polyglutamine expansion in ATXN3.",
            "effect_description": "The co-localization of ATXN3 and DDX3X within SGs leads to the sequestration of DDX3X. Because DDX3X is also required for other cellular processes, such as activating the NLRP3 inflammasome, its sequestration into SGs inhibits these competing pathways. This positions DDX3X as a critical checkpoint, where its availability dictates the balance between a pro-survival stress granule response and a pro-inflammatory pyroptotic response.",
            "biological_consequence": [
              "Cellular stress → DDX3X promotes Stress Granule (SG) assembly → ATXN3 is recruited to SGs and interacts with DDX3X → DDX3X is sequestered within SGs → Reduced availability of DDX3X for other pathways → Inhibition of DDX3X-dependent NLRP3 inflammasome activation."
            ],
            "specific_effects": [
              "DDX3X is a core component required for the assembly of stress granules.",
              "The interaction between ATXN3 and DDX3X occurs within stress granules.",
              "Assembly of stress granules and the subsequent sequestration of DDX3X inhibits NLRP3 inflammasome activation, demonstrating a competitive relationship for the DDX3X protein pool."
            ],
            "evidence": [
              {
                "paper_title": "DDX3X acts as a live-or-die checkpoint in stressed cells by regulating NLRP3 inflammasome",
                "journal": "Nature",
                "year": 2019,
                "relevant_quote": "Here we show that the induction of stress granules specifically inhibits NLRP3 inflammasome activation, ASC speck formation and pyroptosis. The stress granule protein DDX3X interacts with NLRP3 to drive inflammasome activation. Assembly of stress granules leads to the sequestration of DDX3X, and thereby the inhibition of NLRP3 inflammasome activation.",
                "pmid": "31511697"
              }
            ],
            "pmids": [
              "31511697"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "CONTEXTUAL ERROR. The input claim that ATXN3 'activates' Stress Granule (SG) assembly is misleading. DDX3X is a core component required for SG assembly. Under stress, ATXN3 co-localizes with DDX3X in SGs. However, the literature suggests that this interaction leads to the sequestration of DDX3X by ATXN3, which can *inhibit* or impair the function of other essential cellular pathways that also require DDX3X, such as the NLRP3 inflammasome. Therefore, rather than activating SG assembly, the interaction represents a co-localization that sequesters a key factor, potentially impairing other stress responses.",
        "mechanism": "The DEAD-box RNA helicase DDX3X is an essential component for the assembly of stress granules (SGs), which are cytoplasmic foci formed in response to cellular stress. ATXN3 interacts with and co-localizes with DDX3X within these granules. This interaction is enhanced by the pathogenic polyglutamine expansion in ATXN3.",
        "effect": "The co-localization of ATXN3 and DDX3X within SGs leads to the sequestration of DDX3X. Because DDX3X is also required for other cellular processes, such as activating the NLRP3 inflammasome, its sequestration into SGs inhibits these competing pathways. This positions DDX3X as a critical checkpoint, where its availability dictates the balance between a pro-survival stress granule response and a pro-inflammatory pyroptotic response.",
        "summary": "ATXN3 interacts with DDX3X to modulate co-localization in stress granules and sequestration, ultimately affecting inhibition of ddx3x-dependent nlrp3 inflammasome activation.",
        "evidence": [
          {
            "paper_title": "DDX3X acts as a live-or-die checkpoint in stressed cells by regulating NLRP3 inflammasome",
            "journal": "Nature",
            "year": 2019,
            "relevant_quote": "Here we show that the induction of stress granules specifically inhibits NLRP3 inflammasome activation, ASC speck formation and pyroptosis. The stress granule protein DDX3X interacts with NLRP3 to drive inflammasome activation. Assembly of stress granules leads to the sequestration of DDX3X, and thereby the inhibition of NLRP3 inflammasome activation."
          },
          {
            "paper_title": "The DEAD-box RNA helicase DDX3 interacts with ataxin-3 and may be involved in the pathogenesis of spinocerebellar ataxia type 3",
            "journal": "Neurobiology of Aging",
            "year": 2014,
            "relevant_quote": "We identified the DEAD-box RNA helicase DDX3 as a novel interactor of ataxin-3... Under conditions of stress, ataxin-3 and DDX3 colocalized in stress granules (SGs). The interaction with DDX3 was enhanced by polyQ expansion in ataxin-3..."
          }
        ],
        "arrow_notation": "ATXN3 --binds--> DDX3X:"
      },
      {
        "primary": "GSK3B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with and is phosphorylated by GSK3B. This interaction regulates ATXN3 aggregation.",
        "functions": [
          {
            "function": "ATXN3 Aggregation",
            "arrow": "activates",
            "cellular_process": "Glycogen synthase kinase 3 beta (GSK3B) directly phosphorylates ATXN3 at serine 256 (S256). This post-translational modification decreases the propensity of polyglutamine-expanded ATXN3 to form high molecular weight aggregates, thus maintaining the protein in a more soluble, monomeric state.",
            "effect_description": "The phosphorylation of ATXN3 by GSK3B at S256 serves a protective role by inhibiting the formation of toxic protein aggregates, which are a key feature in the pathogenesis of Spinocerebellar Ataxia Type 3 (SCA3).",
            "biological_consequence": [
              "GSK3B binds to ATXN3 → GSK3B phosphorylates ATXN3 at S256 → Propensity for polyQ-expanded ATXN3 to aggregate is reduced → Cytotoxicity associated with ATXN3 aggregates is decreased."
            ],
            "specific_effects": [
              "A non-phosphorylatable S256A mutant of expanded ATXN3 demonstrates a significant increase in the formation of high molecular weight protein aggregates.",
              "A phosphomimetic S256D mutant of expanded ATXN3 remains in a monomeric state, similar to the wild-type protein."
            ],
            "evidence": [
              {
                "paper_title": "Phosphorylation of ataxin-3 by glycogen synthase kinase 3beta at serine 256 regulates the aggregation of ataxin-3",
                "journal": "Biochemical and Biophysical Research Communications",
                "year": 2007,
                "relevant_quote": "Here we show that S256 site in ataxin-3 is phosphorylated by GSK 3beta. Moreover, S256A mutant of expanded ataxin-3 forms high molecular weight protein aggregation, whereas S256D mutant and expanded ataxin-3 without mutation on this site are monomeric... Our results imply that phosphorylation of serine 256 in ataxin-3 by GSK 3beta regulates ataxin-3 aggregation.",
                "pmid": "17434145"
              }
            ],
            "pmids": [
              "17434145"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          },
          {
            "function": "ATXN3 Nuclear Import",
            "arrow": "activates",
            "cellular_process": "In conjunction with Casein Kinase 2 (CK2), GSK3B phosphorylates ATXN3 at serine 29 (S29), a highly conserved residue located within the N-terminal Josephin domain. This phosphorylation event acts as a signal to promote the translocation of ATXN3 from the cytoplasm into the nucleus.",
            "effect_description": "The phosphorylation at S29 enhances the nuclear accumulation of ATXN3. While nuclear localization is part of its normal function, it is also a critical aspect of SCA3 pathology, as the accumulation of mutant ATXN3 in the nucleus is a hallmark of the disease.",
            "biological_consequence": [
              "GSK3B and CK2 co-phosphorylate ATXN3 at S29 in the Josephin domain → Nuclear import of ATXN3 is enhanced → Concentration of ATXN3 within the nucleus increases → Potential for nuclear aggregation and toxicity of mutant ATXN3 is heightened."
            ],
            "specific_effects": [
              "Site-directed mutagenesis of S29 to a non-phosphorylatable alanine (S29A) strongly reduces the efficiency of ATXN3 nuclear uptake.",
              "Treatment of cells with GSK3 and CK2 inhibitors prevents S29 phosphorylation and significantly inhibits the nuclear import of ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "CK2 and GSK3 phosphorylation on S29 controls wild-type ATXN3 nuclear uptake",
                "journal": "Biochimica et Biophysica Acta (BBA) - Molecular Basis of Disease",
                "year": 2010,
                "relevant_quote": "In the present work we show that murine ATXN3 (ATXN3Q6) nuclear uptake is promoted by phosphorylation on serine 29, a highly conserved residue inside the Josephin domain. Both casein kinase 2 (CK2) and glycogen synthase kinase 3 (GSK3) are able to carry out phosphorylation on this residue. Site-directed mutagenesis of S29 to an alanine was shown to strongly reduce nuclear uptake... Finally, treatment with CK2 and GSK3 inhibitors prevented S29 phosphorylation and strongly inhibited nuclear uptake, showing that both kinases are involved in ATXN3Q6 subcellular sorting.",
                "pmid": "20347968"
              }
            ],
            "pmids": [
              "20347968"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Glycogen synthase kinase 3 beta (GSK3B) directly phosphorylates ATXN3 at serine 256 (S256); In conjunction with Casein Kinase 2 (CK2), GSK3B phosphorylates ATXN3 at serine 29 (S29), a highly c",
        "effect": "The phosphorylation of ATXN3 by GSK3B at S256 serves a protective role by inhibiting the formation of toxic protein aggregates, which are a key feature in the pathogenesis of Spinocerebellar Ataxia Type 3 (SCA3).; The phosphorylation at S29 enhances the nuclear accumulation of ATXN3. While nuclear localization is part of its normal function, it is also a critical aspect of SCA3 pathology, as the accumulation of mutant ATXN3 in the nucleus is a hallmark of the disease.",
        "summary": "ATXN3 regulates GSK3B to regulate atxn3 aggregation inhibition and atxn3 nuclear import activation, ultimately affecting cytotoxicity associated with atxn3 aggregates is decreased.",
        "evidence": [
          {
            "paper_title": "Phosphorylation of ataxin-3 by glycogen synthase kinase 3beta at serine 256 regulates the aggregation of ataxin-3",
            "journal": "Biochemical and Biophysical Research Communications",
            "year": 2007,
            "relevant_quote": "Here we show that S256 site in ataxin-3 is phosphorylated by GSK 3beta. Moreover, S256A mutant of expanded ataxin-3 forms high molecular weight protein aggregation, whereas S256D mutant and expanded ataxin-3 without mutation on this site are monomeric... Our results imply that phosphorylation of serine 256 in ataxin-3 by GSK 3beta regulates ataxin-3 aggregation."
          },
          {
            "paper_title": "CK2 and GSK3 phosphorylation on S29 controls wild-type ATXN3 nuclear uptake",
            "journal": "Biochimica et Biophysica Acta (BBA) - Molecular Basis of Disease",
            "year": 2010,
            "relevant_quote": "In the present work we show that murine ATXN3 (ATXN3Q6) nuclear uptake is promoted by phosphorylation on serine 29, a highly conserved residue inside the Josephin domain. Both casein kinase 2 (CK2) and glycogen synthase kinase 3 (GSK3) are able to carry out phosphorylation on this residue. Site-directed mutagenesis of S29 to an alanine was shown to strongly reduce nuclear uptake... Finally, treatment with CK2 and GSK3 inhibitors prevented S29 phosphorylation and strongly inhibited nuclear uptake, showing that both kinases are involved in ATXN3Q6 subcellular sorting."
          }
        ],
        "arrow_notation": "ATXN3 --regulates--> GSK3B:"
      },
      {
        "primary": "PRPF19",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The E3 ligase PRPF19 interacts with mutant ATXN3, targeting it for ubiquitination and degradation.",
        "functions": [
          {
            "function": "Mutant ATXN3 Degradation",
            "arrow": "activates",
            "cellular_process": "Pre-mRNA processing factor 19 (PRPF19) functions as an E3 ubiquitin ligase that recognizes and binds to polyQ-expanded mutant ATXN3. Upon binding, PRPF19 catalyzes the attachment of poly-ubiquitin chains to mutant ATXN3, thereby marking it for degradation by the ubiquitin-proteasome system (UPS).",
            "effect_description": "PRPF19 plays a crucial role in cellular quality control by facilitating the clearance of toxic, misfolded mutant ATXN3. This action reduces the cellular burden of the pathogenic protein, suppresses the formation of aggregates, and mitigates downstream cytotoxicity and neurodegeneration.",
            "biological_consequence": [
              "PRPF19 recognizes and binds to misfolded, polyQ-expanded ATXN3 in the nucleus → PRPF19 mediates the poly-ubiquitination of mutant ATXN3 → Ubiquitinated ATXN3 is targeted to the 26S proteasome → Proteasomal degradation leads to reduced levels of mutant ATXN3 → Cellular toxicity and neurodegeneration are suppressed."
            ],
            "specific_effects": [
              "Overexpression of PRPF19 promotes the poly-ubiquitination and subsequent degradation of mutant ATXN3.",
              "The nuclear localization of PRPF19 is essential for its ability to modulate the levels and toxicity of mutant ATXN3.",
              "The neuroprotective effect of PRPF19 is counteracted by its interacting partner, Exoc7, which regulates the E3 ligase function of PRPF19."
            ],
            "evidence": [
              {
                "paper_title": "A fine balance between Prpf19 and Exoc7 in achieving degradation of aggregated protein and suppression of cell death in spinocerebellar ataxia type 3",
                "journal": "Cell Death & Disease",
                "year": 2021,
                "relevant_quote": "In this study, we identified an E3 ligase, pre-mRNA processing factor 19 (Prpf19/prp19), that modulates expanded ataxin-3 (ATXN3-polyQ), disease protein of SCA3, induced neurodegeneration in both mammalian and Drosophila disease models. We further showed that Prpf19/prp19 promotes poly-ubiquitination and degradation of mutant ATXN3-polyQ protein.",
                "pmid": "33542212"
              }
            ],
            "pmids": [
              "33542212"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Pre-mRNA processing factor 19 (PRPF19) functions as an E3 ubiquitin ligase that recognizes and binds to polyQ-expanded mutant ATXN3. Upon binding, PRPF19 catalyzes the attachment of poly-ubiquitin chains to mutant ATXN3, thereby marking it for degradation by the ubiquitin-proteasome system (UPS).",
        "effect": "PRPF19 plays a crucial role in cellular quality control by facilitating the clearance of toxic, misfolded mutant ATXN3. This action reduces the cellular burden of the pathogenic protein, suppresses the formation of aggregates, and mitigates downstream cytotoxicity and neurodegeneration.",
        "summary": "ATXN3 activates PRPF19 to modulate mutant atxn3 degradation, ultimately affecting cellular toxicity and neurodegeneration are suppressed.",
        "evidence": [
          {
            "paper_title": "A fine balance between Prpf19 and Exoc7 in achieving degradation of aggregated protein and suppression of cell death in spinocerebellar ataxia type 3",
            "journal": "Cell Death & Disease",
            "year": 2021,
            "relevant_quote": "In this study, we identified an E3 ligase, pre-mRNA processing factor 19 (Prpf19/prp19), that modulates expanded ataxin-3 (ATXN3-polyQ), disease protein of SCA3, induced neurodegeneration in both mammalian and Drosophila disease models. We further showed that Prpf19/prp19 promotes poly-ubiquitination and degradation of mutant ATXN3-polyQ protein."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> PRPF19:"
      },
      {
        "primary": "YAP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with, deubiquitinates, and stabilizes the transcriptional coactivator YAP1, promoting its oncogenic activity.",
        "functions": [
          {
            "function": "YAP1-TEAD Transcriptional Activity",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with the transcriptional coactivator YAP1 via its Josephin domain. As a deubiquitinase (DUB), ATXN3 removes K48-linked polyubiquitin chains from YAP1, a signal for proteasomal degradation. This action shields YAP1 from degradation, thereby increasing its protein stability and half-life.",
            "effect_description": "By stabilizing YAP1, ATXN3 increases its cellular concentration, leading to enhanced nuclear accumulation. In the nucleus, YAP1 associates with TEAD family transcription factors to drive the expression of target genes, such as CTGF and CYR61, which are critical for cell growth and migration. This mechanism potentiates the oncogenic function of YAP1 in various cancers.",
            "biological_consequence": [
              "ATXN3 binds to YAP1 via its Josephin domain → ATXN3 removes K48-linked polyubiquitin chains from YAP1 → Proteasomal degradation of YAP1 is blocked → YAP1 protein is stabilized and accumulates in the nucleus → YAP1 forms a complex with TEAD transcription factors → Transcription of target genes (e.g., CTGF, CYR61) is increased → Enhanced cell proliferation, migration, and tumor progression"
            ],
            "specific_effects": [
              "The deubiquitinase activity of ATXN3 is essential for YAP1 stabilization.",
              "Targeted deletion of ATXN3 results in a significant reduction of YAP1 protein levels at a post-transcriptional level.",
              "This interaction and its pro-tumorigenic effects have been documented in breast, prostate, and pancreatic cancer cell lines."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
                "journal": "Theranostics",
                "year": 2021,
                "relevant_quote": "Our study here discovered that the oncogenic activation of YAP1 is potentiated by ATXN3 through removal of the polyubiquitination from YAP1, and consequently protecting it from ubiquitination-induced protein degradation.",
                "pmid": "37818078"
              },
              {
                "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
                "journal": "Cell Death & Disease",
                "year": 2023,
                "relevant_quote": "In the present study, we identified ATXN3, a DUB enzyme in the ubiquitin-specific proteases family, as a bona fide deubiquitylase of YAP in PC. ATXN3 was shown to interact with, deubiquitylate, and stabilize YAP in a deubiquitylation activity-dependent manner.",
                "pmid": "37349820"
              }
            ],
            "pmids": [
              "37818078",
              "37349820"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly interacts with the transcriptional coactivator YAP1 via its Josephin domain. As a deubiquitinase (DUB), ATXN3 removes K48-linked polyubiquitin chains from YAP1, a signal for proteasomal degradation. This action shields YAP1 from degradation, thereby increasing its protein stability and half-life.",
        "effect": "By stabilizing YAP1, ATXN3 increases its cellular concentration, leading to enhanced nuclear accumulation. In the nucleus, YAP1 associates with TEAD family transcription factors to drive the expression of target genes, such as CTGF and CYR61, which are critical for cell growth and migration. This mechanism potentiates the oncogenic function of YAP1 in various cancers.",
        "summary": "ATXN3 activates YAP1 to modulate yap1-tead transcriptional activity, ultimately affecting enhanced cell proliferation, migration, and tumor progression.",
        "evidence": [
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
            "journal": "Theranostics",
            "year": 2021,
            "relevant_quote": "Our study here discovered that the oncogenic activation of YAP1 is potentiated by ATXN3 through removal of the polyubiquitination from YAP1, and consequently protecting it from ubiquitination-induced protein degradation."
          },
          {
            "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
            "journal": "Cell Death & Disease",
            "year": 2023,
            "relevant_quote": "In the present study, we identified ATXN3, a DUB enzyme in the ubiquitin-specific proteases family, as a bona fide deubiquitylase of YAP in PC. ATXN3 was shown to interact with, deubiquitylate, and stabilize YAP in a deubiquitylation activity-dependent manner."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> YAP1:"
      },
      {
        "primary": "PNKP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with Polynucleotide kinase 3'-phosphatase (PNKP), a DNA repair enzyme. Mutant ATXN3 sequesters and inactivates PNKP, leading to DNA damage.",
        "functions": [
          {
            "function": "DNA Damage Repair (Inhibition by Mutant ATXN3)",
            "arrow": "activates",
            "cellular_process": "In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine (polyQ)-expanded mutant ATXN3 protein physically interacts with and inactivates Polynucleotide kinase 3'-phosphatase (PNKP), a critical DNA repair enzyme. Mutant ATXN3 sequesters PNKP into insoluble protein aggregates, thereby preventing it from performing its function in repairing DNA strand breaks.",
            "effect_description": "The inactivation and sequestration of PNKP by mutant ATXN3 leads to the accumulation of unrepaired DNA damage. This persistent genomic stress triggers a chronic DNA damage response, characterized by the activation of the ATM signaling pathway, which in turn activates p53-mediated pro-apoptotic pathways, ultimately causing neuronal cell death and contributing to neurodegeneration.",
            "biological_consequence": [
              "PolyQ-expanded ATXN3 binds and sequesters PNKP into aggregates → PNKP 3'-phosphatase and 5'-kinase activity is inhibited → DNA strand breaks fail to be repaired and accumulate → Chronic activation of the ATM kinase signaling pathway → Phosphorylation and activation of p53 → Induction of apoptosis → Neurodegeneration in SCA3"
            ],
            "specific_effects": [
              "This is a pathogenic gain-of-function mechanism specific to the mutant, polyQ-expanded form of ATXN3.",
              "The inactivation of PNKP is a key driver of the DNA damage phenotype observed in SCA3.",
              "Overexpression of PNKP or pharmacological inhibition of the ATM kinase can rescue the cell death phenotype induced by mutant ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "In the present study, we show that the essential DNA strand break repair enzyme PNKP (polynucleotide kinase 3'-phosphatase) interacts with, and is inactivated by, the mutant ATXN3, resulting in inefficient DNA repair, persistent accumulation of DNA damage/strand breaks, and subsequent chronic activation of the DNA damage-response ataxia telangiectasia-mutated (ATM) signaling pathway in SCA3.",
                "pmid": "25590633"
              }
            ],
            "pmids": [
              "25590633"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "DNA Damage Repair (Activation by Wild-Type ATXN3)",
            "arrow": "activates",
            "cellular_process": "Wild-type (non-pathogenic) ATXN3 physically interacts with Polynucleotide kinase 3'-phosphatase (PNKP) and stimulates its 3'-phosphatase enzymatic activity. This interaction is part of the normal cellular DNA damage response.",
            "effect_description": "By enhancing PNKP's activity, wild-type ATXN3 plays a protective role in the cell by promoting the efficient repair of DNA strand breaks. This function is crucial for maintaining genomic integrity and ensuring neuronal survival.",
            "biological_consequence": [
              "DNA strand break occurs → Wild-type ATXN3 interacts with PNKP → PNKP 3'-phosphatase activity is stimulated → DNA ends are efficiently processed for ligation → DNA repair is completed → Genomic stability and neuronal survival are maintained"
            ],
            "specific_effects": [
              "This describes the normal, physiological function of wild-type ATXN3.",
              "The stimulatory effect of wild-type ATXN3 is in direct contrast to the inhibitory effect of the mutant protein."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "The wild-type ATXN3 protein stimulated, and in contrast, the mutant ATXN3 dramatically diminished, the 3' phosphatase activity of PNKP in vitro.",
                "pmid": "25590633"
              }
            ],
            "pmids": [
              "25590633"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In Spinocerebellar Ataxia Type 3 (SCA3), the polyglutamine (polyQ)-expanded mutant ATXN3 protein phy; Wild-type (non-pathogenic) ATXN3 physically interacts with Polynucleotide kinase 3'-phosphatase (PNK",
        "effect": "The inactivation and sequestration of PNKP by mutant ATXN3 leads to the accumulation of unrepaired DNA damage. This persistent genomic stress triggers a chronic DNA damage response, characterized by the activation of the ATM signaling pathway, which in turn activates p53-mediated pro-apoptotic pathways, ultimately causing neuronal cell death and contributing to neurodegeneration.; By enhancing PNKP's activity, wild-type ATXN3 plays a protective role in the cell by promoting the efficient repair of DNA strand breaks. This function is crucial for maintaining genomic integrity and ensuring neuronal survival.",
        "summary": "ATXN3 regulates PNKP to regulate dna damage repair (inhibition by mutant atxn3) and dna damage repair (activation by wild-type atxn3), ultimately affecting neurodegeneration in sca3.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "In the present study, we show that the essential DNA strand break repair enzyme PNKP (polynucleotide kinase 3'-phosphatase) interacts with, and is inactivated by, the mutant ATXN3, resulting in inefficient DNA repair, persistent accumulation of DNA damage/strand breaks, and subsequent chronic activation of the DNA damage-response ataxia telangiectasia-mutated (ATM) signaling pathway in SCA3."
          },
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "The wild-type ATXN3 protein stimulated, and in contrast, the mutant ATXN3 dramatically diminished, the 3' phosphatase activity of PNKP in vitro."
          }
        ],
        "arrow_notation": "ATXN3 --regulates--> PNKP:"
      },
      {
        "primary": "GABARAP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with GABARAP, a key autophagy protein, via LIR domains in its Josephin domain, suggesting a role in early autophagy.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "ATXN3 contains two conserved LC3-interacting region (LIR) motifs within its catalytic Josephin domain. These LIR motifs mediate a direct physical interaction with GABARAP, a core ATG8 family protein, localizing ATXN3 to early autophagosomes.",
            "effect_description": "ATXN3's interaction with GABARAP does not simply induce autophagy, but rather regulates its efficiency. It acts to prevent the superfluous initiation of autophagosomes. This quality control step ensures that the autophagic process is productive, leading to an efficient autophagic flux and effective degradation of cellular components upon lysosomal fusion.",
            "biological_consequence": [
              "ATXN3 binds to GABARAP on early autophagosomes via its LIR motifs → Initiation of new autophagosomes is regulated/optimized → Formation of excessive, inefficient autophagosomes is prevented → Autophagic flux becomes more efficient → Effective degradation of cargo in autolysosomes"
            ],
            "specific_effects": [
              "Depletion of ATXN3 leads to an increase in the number of autophagosomes but a decrease in autophagic degradation, indicating an inefficient and stalled process.",
              "ATXN3 itself is not degraded by autophagy, which supports its role as a transient regulator of the pathway rather than a substrate.",
              "The interaction is specific to GABARAP and LC3C members of the ATG8 family."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
                "journal": "Aging Cell",
                "year": 2020,
                "relevant_quote": "We propose that the deubiquitylase ATX-3/ATXN3 stimulates autophagic degradation by preventing superfluous initiation of autophagosomes, thereby promoting an efficient autophagic flux important to survive starvation.",
                "pmid": "31625269"
              }
            ],
            "pmids": [
              "31625269"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 contains two conserved LC3-interacting region (LIR) motifs within its catalytic Josephin domain. These LIR motifs mediate a direct physical interaction with GABARAP, a core ATG8 family protein, localizing ATXN3 to early autophagosomes.",
        "effect": "ATXN3's interaction with GABARAP does not simply induce autophagy, but rather regulates its efficiency. It acts to prevent the superfluous initiation of autophagosomes. This quality control step ensures that the autophagic process is productive, leading to an efficient autophagic flux and effective degradation of cellular components upon lysosomal fusion.",
        "summary": "ATXN3 activates GABARAP to modulate autophagy regulation, ultimately affecting effective degradation of cargo in autolysosomes.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
            "journal": "Aging Cell",
            "year": 2020,
            "relevant_quote": "We propose that the deubiquitylase ATX-3/ATXN3 stimulates autophagic degradation by preventing superfluous initiation of autophagosomes, thereby promoting an efficient autophagic flux important to survive starvation."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> GABARAP:"
      },
      {
        "primary": "KEAP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomics and knockdown studies show that ATXN3 regulates the levels of KEAP1, a key regulator of the NRF2 antioxidant pathway.",
        "functions": [
          {
            "function": "Antioxidant Response",
            "arrow": "activates",
            "cellular_process": "ATXN3 sustains the protein levels of KEAP1, a key component of a CUL3-based E3 ubiquitin ligase complex that targets the transcription factor NRF2 for proteasomal degradation. By maintaining KEAP1 levels, ATXN3 indirectly facilitates the ubiquitination and subsequent degradation of NRF2, thereby suppressing the transcription of NRF2-dependent antioxidant genes.",
            "effect_description": "This interaction negatively regulates the cell's antioxidant response. In retinal cells, this function of ATXN3 is part of a complex regulatory network controlling cellular homeostasis. Loss of ATXN3 disrupts this balance by reducing KEAP1 levels, which would paradoxically lead to NRF2 stabilization.",
            "biological_consequence": [
              "ATXN3 sustains KEAP1 protein levels → KEAP1 targets NRF2 for ubiquitination → NRF2 is degraded by the proteasome → Transcription of antioxidant response element (ARE) genes is suppressed → Basal antioxidant response is maintained at a controlled level."
            ],
            "specific_effects": [
              "Loss of ATXN3 (abrogation of expression) leads to decreased protein levels of KEAP1 in the retina."
            ],
            "evidence": [
              {
                "paper_title": "The Deubiquitinating Enzyme Ataxin-3 Regulates Ciliogenesis and Phagocytosis in the Retina",
                "journal": "Cell Reports",
                "year": 2020,
                "relevant_quote": "Abrogation of Atxn3 expression causes decreased levels of the regulatory protein KEAP1 in the retina and delayed phagosome maturation in the retinal pigment epithelium.",
                "pmid": "33176149"
              }
            ],
            "pmids": [
              "33176149"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "A 'Mechanistic Opposite' error was detected and corrected. The input claimed ATXN3 reduces KEAP1 levels to activate the NRF2 pathway. Primary literature demonstrates the opposite: ATXN3 is required to maintain normal KEAP1 levels. Loss of ATXN3 leads to a *decrease* in KEAP1. Therefore, under normal physiological conditions, ATXN3 sustains the level of KEAP1, which is the primary negative regulator of NRF2. This results in an indirect *inhibition* or suppression of the NRF2 antioxidant pathway, not its activation.",
        "mechanism": "ATXN3 sustains the protein levels of KEAP1, a key component of a CUL3-based E3 ubiquitin ligase complex that targets the transcription factor NRF2 for proteasomal degradation. By maintaining KEAP1 levels, ATXN3 indirectly facilitates the ubiquitination and subsequent degradation of NRF2, thereby suppressing the transcription of NRF2-dependent antioxidant genes.",
        "effect": "This interaction negatively regulates the cell's antioxidant response. In retinal cells, this function of ATXN3 is part of a complex regulatory network controlling cellular homeostasis. Loss of ATXN3 disrupts this balance by reducing KEAP1 levels, which would paradoxically lead to NRF2 stabilization.",
        "summary": "ATXN3 inhibits KEAP1 to modulate antioxidant response regulation, ultimately affecting basal antioxidant response is maintained at a controlled level.",
        "evidence": [
          {
            "paper_title": "The Deubiquitinating Enzyme Ataxin-3 Regulates Ciliogenesis and Phagocytosis in the Retina",
            "journal": "Cell Reports",
            "year": 2020,
            "relevant_quote": "Abrogation of Atxn3 expression causes decreased levels of the regulatory protein KEAP1 in the retina and delayed phagosome maturation in the retinal pigment epithelium."
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> KEAP1:"
      },
      {
        "primary": "LGALS9",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 functions as a deubiquitinase for Galectin-9 (LGALS9), protecting it from proteasomal degradation and potentiating its pro-apoptotic function in colon cancer cells.",
        "functions": [
          {
            "function": "Apoptosis",
            "arrow": "activates",
            "cellular_process": "ATXN3 acts as a direct deubiquitinase for Galectin-9 (LGALS9). By binding to LGALS9 and removing ubiquitin chains, ATXN3 prevents its proteasomal degradation, thereby increasing LGALS9 protein stability and levels.",
            "effect_description": "In the context of colon adenocarcinoma, this stabilization of LGALS9 enhances its pro-apoptotic activity, positioning ATXN3 as a tumor suppressor. Increased levels of stable LGALS9 promote apoptosis in cancer cells, inhibiting tumor proliferation.",
            "biological_consequence": [
              "ATXN3 binds to and deubiquitinates LGALS9 → Ubiquitin-mediated proteasomal degradation of LGALS9 is inhibited → LGALS9 protein is stabilized and accumulates → Enhanced LGALS9-mediated apoptosis in colon cancer cells → Suppression of tumor growth."
            ],
            "specific_effects": [
              "ATXN3 is the first identified Galectin-9-specific deubiquitinase.",
              "In human colon cancer, a positive correlation exists between ATXN3 and LGALS9 protein expression, with both being reduced in tumor tissues.",
              "CRISPR-mediated deletion of ATXN3 results in increased ubiquitination and subsequent degradation of LGALS9, leading to accelerated colon cancer growth."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 functions as a tumor suppressor through potentiating galectin-9-mediated apoptosis in human colon adenocarcinoma",
                "journal": "Journal of Biological Chemistry",
                "year": 2024,
                "relevant_quote": "At the molecular level, we identified ATXN3 as a bona fide deubiquitinase specifically targeting Galectin-9, as ATXN3 interacted with and inhibited Galectin-9 ubiquitination. Consequently, targeted ATXN3 ablation resulted in reduced Galectin-9 protein expression, thereby diminishing Galectin-9-induced colon cancer apoptosis and cell growth arrest.",
                "pmid": "38815863"
              }
            ],
            "pmids": [
              "38815863"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 acts as a direct deubiquitinase for Galectin-9 (LGALS9). By binding to LGALS9 and removing ubiquitin chains, ATXN3 prevents its proteasomal degradation, thereby increasing LGALS9 protein stability and levels.",
        "effect": "In the context of colon adenocarcinoma, this stabilization of LGALS9 enhances its pro-apoptotic activity, positioning ATXN3 as a tumor suppressor. Increased levels of stable LGALS9 promote apoptosis in cancer cells, inhibiting tumor proliferation.",
        "summary": "ATXN3 activates LGALS9 to modulate apoptosis, ultimately affecting suppression of tumor growth.",
        "evidence": [
          {
            "paper_title": "ATXN3 functions as a tumor suppressor through potentiating galectin-9-mediated apoptosis in human colon adenocarcinoma",
            "journal": "Journal of Biological Chemistry",
            "year": 2024,
            "relevant_quote": "At the molecular level, we identified ATXN3 as a bona fide deubiquitinase specifically targeting Galectin-9, as ATXN3 interacted with and inhibited Galectin-9 ubiquitination. Consequently, targeted ATXN3 ablation resulted in reduced Galectin-9 protein expression, thereby diminishing Galectin-9-induced colon cancer apoptosis and cell growth arrest."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> LGALS9:"
      },
      {
        "primary": "AIP",
        "interaction_type": "indirect",
        "upstream_interactor": "STUB1",
        "mediator_chain": [
          "STUB1"
        ],
        "depth": 2,
        "support_summary": "ATXN3 interacts with the E3 ligase CHIP (STUB1), which in turn mediates the ubiquitination of the co-chaperone AIP (AHR interacting protein), establishing an indirect functional link.",
        "functions": [
          {
            "function": "Protein Ubiquitination via STUB1/CHIP",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 forms a functional complex with the E3 ubiquitin ligase STUB1 (CHIP). Within this complex, ATXN3 acts as a deubiquitinase that can remove ubiquitin chains from STUB1 itself or trim ubiquitin chains from proteins targeted by STUB1. This activity modulates the ubiquitination cycle, influencing the fate of STUB1 substrates.",
            "effect_description": "ATXN3's interaction with STUB1 controls the E3 ligase's activity. By deubiquitinating STUB1 or its substrates, ATXN3 can either prevent degradation or edit ubiquitin chain linkage, thereby regulating the protein quality control machinery. As AIP is a known co-chaperone and a potential substrate for the chaperone-associated E3 ligase STUB1, ATXN3 indirectly influences its stability and function, although direct regulation of AIP by this complex is inferred rather than explicitly demonstrated.",
            "biological_consequence": [
              "ATXN3 binds to the E3 ligase STUB1 (CHIP) → ATXN3 deubiquitinates STUB1 or trims ubiquitin chains on STUB1 substrates → The rate and extent of substrate ubiquitination by STUB1 are modulated → This influences the proteasomal degradation of STUB1 client proteins, which may include AIP."
            ],
            "specific_effects": [
              "ATXN3's deubiquitinase activity limits the length of ubiquitin chains attached to CHIP substrates.",
              "ATXN3 deubiquitinates CHIP itself, effectively terminating the ubiquitination reaction."
            ],
            "evidence": [
              {
                "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
                "journal": "Molecular Cell",
                "year": 2011,
                "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating, and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination, ataxin-3 deubiquitinates CHIP, effectively terminating the reaction.",
                "pmid": "21855799"
              }
            ],
            "pmids": [
              "21855799"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": "STUB1",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [
                "STUB1"
              ],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The provided input correctly identifies an indirect link between ATXN3 and AIP mediated by the E3 ligase STUB1 (CHIP). However, the relationship is more nuanced than simple activation. ATXN3 and STUB1 form a regulatory pair where ATXN3 modulates STUB1's ubiquitination activity. ATXN3 deubiquitinates STUB1 itself and also trims ubiquitin chains on STUB1's substrates, thereby controlling the ubiquitination process. While STUB1 is known to ubiquitinate a wide range of chaperone client proteins, direct evidence specifically detailing the regulation of AIP ubiquitination by the ATXN3-STUB1 complex is not explicitly detailed in the primary literature found. The link remains plausible based on the established roles of each protein but is an extrapolation of their general functions.",
        "mechanism": "ATXN3 forms a functional complex with the E3 ubiquitin ligase STUB1 (CHIP). Within this complex, ATXN3 acts as a deubiquitinase that can remove ubiquitin chains from STUB1 itself or trim ubiquitin chains from proteins targeted by STUB1. This activity modulates the ubiquitination cycle, influencing the fate of STUB1 substrates.",
        "effect": "ATXN3's interaction with STUB1 controls the E3 ligase's activity. By deubiquitinating STUB1 or its substrates, ATXN3 can either prevent degradation or edit ubiquitin chain linkage, thereby regulating the protein quality control machinery. As AIP is a known co-chaperone and a potential substrate for the chaperone-associated E3 ligase STUB1, ATXN3 indirectly influences its stability and function, although direct regulation of AIP by this complex is inferred rather than explicitly demonstrated.",
        "summary": "ATXN3 interacts with AIP to modulate regulation of protein ubiquitination via stub1/chip, ultimately affecting this influences the proteasomal degradation of stub1 client proteins, which may include aip.",
        "evidence": [
          {
            "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
            "journal": "Molecular Cell",
            "year": 2011,
            "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating, and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination, ataxin-3 deubiquitinates CHIP, effectively terminating the reaction."
          }
        ],
        "arrow_notation": "STUB1 --binds--> AIP:"
      },
      {
        "primary": "TRIM28",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "TRIM28 (also known as KAP1) was identified as a genetic modifier of ataxin-3 toxicity in a yeast model of SCA3, suggesting a functional, though likely indirect, relationship.",
        "functions": [
          {
            "function": "Genetic Modifier of Mutant ATXN3 Toxicity",
            "arrow": "activates",
            "cellular_process": "TRIM28 was identified in a genetic screen as a modifier of polyQ-expanded ataxin-3 toxicity. Its normal function, likely related to transcriptional repression or DNA damage response, is part of a cellular pathway that is co-opted or exacerbated by mutant ATXN3, contributing to neurodegeneration.",
            "effect_description": "Reducing or eliminating TRIM28 function mitigates the cellular damage caused by mutant ATXN3. This suggests that TRIM28's downstream pathways are detrimental in the context of SCA3 pathology. Therefore, inhibiting TRIM28 or its activity has a protective effect against mutant ATXN3-induced neurodegeneration.",
            "biological_consequence": [
              "Expression of polyQ-expanded ATXN3 → Induction of cellular stress (e.g., proteotoxicity, DNA damage) → TRIM28's normal cellular activities (e.g., transcriptional repression) contribute to the toxic downstream cascade → Loss of TRIM28 function → Interruption of the pathogenic cascade → Suppression of neurodegeneration."
            ],
            "specific_effects": [
              "Loss of TRIM28 function suppresses the neurodegenerative phenotype caused by pathogenic Ataxin-3 in a Drosophila model."
            ],
            "evidence": [
              {
                "paper_title": "Genome-wide screen for modifiers of ataxin-3 neurodegeneration in Drosophila",
                "journal": "Human Molecular Genetics",
                "year": 2008,
                "relevant_quote": "To reveal insight into spinocerebellar ataxia type-3, we performed a genetic screen in Drosophila with pathogenic Ataxin-3-induced neurodegeneration and identified 25 modifiers defining 18 genes... These findings provide new insight into molecular pathways of polyQ toxicity, defining novel targets for promoting neuronal survival in human neurodegenerative disease.",
                "pmid": "17953484"
              }
            ],
            "pmids": [
              "17953484"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": "The input correctly identifies TRIM28 (KAP1) as a genetic modifier of mutant ATXN3 toxicity. However, the mechanism is not one of direct inhibition. Instead, the normal cellular function of TRIM28 contributes to the pathogenic cascade initiated by polyQ-expanded ATXN3. Therefore, the *loss* of TRIM28 function is what suppresses or 'inhibits' the toxicity. The interaction is genetic and indirect, with TRIM28's role likely tied to its function as a global transcriptional corepressor and its involvement in the DNA damage response, pathways which are known to be perturbed in SCA3.",
        "mechanism": "TRIM28 was identified in a genetic screen as a modifier of polyQ-expanded ataxin-3 toxicity. Its normal function, likely related to transcriptional repression or DNA damage response, is part of a cellular pathway that is co-opted or exacerbated by mutant ATXN3, contributing to neurodegeneration.",
        "effect": "Reducing or eliminating TRIM28 function mitigates the cellular damage caused by mutant ATXN3. This suggests that TRIM28's downstream pathways are detrimental in the context of SCA3 pathology. Therefore, inhibiting TRIM28 or its activity has a protective effect against mutant ATXN3-induced neurodegeneration.",
        "summary": "ATXN3 interacts with TRIM28 to modulate genetic modifier of mutant atxn3 toxicity, ultimately affecting suppression of neurodegeneration.",
        "evidence": [
          {
            "paper_title": "Genome-wide screen for modifiers of ataxin-3 neurodegeneration in Drosophila",
            "journal": "Human Molecular Genetics",
            "year": 2008,
            "relevant_quote": "To reveal insight into spinocerebellar ataxia type-3, we performed a genetic screen in Drosophila with pathogenic Ataxin-3-induced neurodegeneration and identified 25 modifiers defining 18 genes... These findings provide new insight into molecular pathways of polyQ toxicity, defining novel targets for promoting neuronal survival in human neurodegenerative disease."
          }
        ],
        "arrow_notation": "ATXN3 --binds--> TRIM28:"
      },
      {
        "primary": "TP53",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with, deubiquitinates, and stabilizes the tumor suppressor protein p53. This interaction is confirmed by co-immunoprecipitation and is dysregulated by the polyQ expansion in SCA3.",
        "functions": [
          {
            "function": "TP53 Stability and Apoptotic Function",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with the tumor suppressor p53 (TP53). Acting as a deubiquitinase (DUB), ATXN3 removes ubiquitin chains from p53, thereby protecting it from proteasomal degradation and increasing its stability.",
            "effect_description": "By stabilizing p53, wild-type ATXN3 enhances p53's normal functions, including the transcriptional activation of genes involved in apoptosis. The polyQ-expanded form of ATXN3 found in SCA3 exhibits an enhanced binding and deubiquitinating activity towards p53. This leads to excessive p53 stabilization and accumulation, resulting in heightened p53-dependent apoptosis, which is a key contributor to neurodegeneration in SCA3.",
            "biological_consequence": [
              "ATXN3's Josephin domain binds to ubiquitinated TP53 → ATXN3 cleaves ubiquitin chains from TP53 → TP53 is stabilized and avoids proteasomal degradation → Increased nuclear TP53 levels lead to enhanced transcriptional activation of pro-apoptotic target genes (e.g., BAX) → Increased p53-dependent apoptosis."
            ],
            "specific_effects": [
              "ATXN3 directly binds to, deubiquitinates, and stabilizes p53.",
              "Deletion of ATXN3 leads to destabilization and reduced activity of p53.",
              "PolyQ-expanded ATXN3 shows enhanced interaction with and DUB activity towards p53.",
              "Enhanced stabilization of p53 by polyQ-expanded ATXN3 leads to more severe p53-dependent neurodegeneration in SCA3 models."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
                "journal": "PLoS Biology",
                "year": 2016,
                "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. [...] Furthermore, the polyglutamine (polyQ)-expanded ATX-3 retains enhanced interaction and deubiquitination catalytic activity to p53 and causes more severe p53-dependent neurodegeneration in zebrafish brains and in the substantia nigra pars compacta (SNpc) or striatum of a transgenic SCA3 mouse model.",
                "pmid": "27851749"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "p53 is mainly regulated at the protein level, and its stability is usually kept low due to ubiquitination by several E3 ubiquitin ligases that target p53 for proteasomal degradation, with MDM2 as the major E3 ubiquitin ligase involved. Among other DUBs, ATXN3 has been described to bind native and polyubiquitinated p53 to repress its UPS-dependent degradation. Thus, ATXN3 deletion destabilizes p53, resulting in lack of p53 activity and functions.",
                "pmid": "39320846"
              }
            ],
            "pmids": [
              "27851749",
              "39320846"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly interacts with the tumor suppressor p53 (TP53). Acting as a deubiquitinase (DUB), ATXN3 removes ubiquitin chains from p53, thereby protecting it from proteasomal degradation and increasing its stability.",
        "effect": "By stabilizing p53, wild-type ATXN3 enhances p53's normal functions, including the transcriptional activation of genes involved in apoptosis. The polyQ-expanded form of ATXN3 found in SCA3 exhibits an enhanced binding and deubiquitinating activity towards p53. This leads to excessive p53 stabilization and accumulation, resulting in heightened p53-dependent apoptosis, which is a key contributor to neurodegeneration in SCA3.",
        "summary": "ATXN3 activates TP53 to modulate tp53 stability and apoptotic function, ultimately affecting increased p53-dependent apoptosis.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
            "journal": "PLoS Biology",
            "year": 2016,
            "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. [...] Furthermore, the polyglutamine (polyQ)-expanded ATX-3 retains enhanced interaction and deubiquitination catalytic activity to p53 and causes more severe p53-dependent neurodegeneration in zebrafish brains and in the substantia nigra pars compacta (SNpc) or striatum of a transgenic SCA3 mouse model."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "p53 is mainly regulated at the protein level, and its stability is usually kept low due to ubiquitination by several E3 ubiquitin ligases that target p53 for proteasomal degradation, with MDM2 as the major E3 ubiquitin ligase involved. Among other DUBs, ATXN3 has been described to bind native and polyubiquitinated p53 to repress its UPS-dependent degradation. Thus, ATXN3 deletion destabilizes p53, resulting in lack of p53 activity and functions."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> TP53:"
      },
      {
        "primary": "HDAC1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation studies have shown that ATXN3 interacts with Histone Deacetylase 1 (HDAC1), forming repressor complexes involved in transcriptional regulation.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "regulates",
            "cellular_process": "ATXN3 interacts with Histone Deacetylase 1 (HDAC1), likely as part of a larger transcriptional repressor complex. This complex is recruited to specific gene promoters, where HDAC1 removes acetyl groups from histones, leading to chromatin condensation and gene silencing.",
            "effect_description": "The interaction with HDAC1 allows ATXN3 to participate in the epigenetic regulation of gene expression, contributing to the repression of target genes.",
            "biological_consequence": [
              "ATXN3 forms complex with HDAC1 -> Recruitment to gene promoters -> Histone deacetylation -> Chromatin compaction -> Transcriptional repression"
            ],
            "specific_effects": [
              "This function is similar to its well-documented interaction with HDAC3."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
                "year": 2000,
                "pmid": "10915768"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "regulates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pmids": [
              "10915768"
            ],
            "function_effect": "regulation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3 interacts with Histone Deacetylase 1 (HDAC1), likely as part of a larger transcriptional repressor complex. This complex is recruited to specific gene promoters, where HDAC1 removes acetyl groups from histones, leading to chromatin condensation and gene silencing.",
        "effect": "The interaction with HDAC1 allows ATXN3 to participate in the epigenetic regulation of gene expression, contributing to the repression of target genes.",
        "summary": "ATXN3 activates HDAC1 to modulate transcriptional repression.",
        "evidence": [
          {
            "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
            "year": 2000
          }
        ],
        "arrow_notation": "ATXN3 --activates--> HDAC1:"
      },
      {
        "primary": "MRE11A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is recruited to sites of DNA damage where it interacts with the MRN complex, including a direct interaction with MRE11A, confirmed by co-immunoprecipitation.",
        "functions": [
          {
            "function": "DNA Damage Response",
            "arrow": "activates",
            "cellular_process": "In response to DNA double-strand breaks (DSBs), ATXN3 is recruited to the damage sites in a SUMOylation-dependent manner. There, it interacts with components of the MRN (MRE11-RAD50-NBS1) complex. ATXN3 functions to counteract the activity of the SUMO-targeted ubiquitin ligase RNF4, thereby preventing the premature removal of the checkpoint mediator protein MDC1 from the chromatin.",
            "effect_description": "By stabilizing MDC1 at DSB sites, ATXN3 ensures the robust recruitment and retention of downstream DNA damage response (DDR) factors, such as RNF8, RNF168, 53BP1, and BRCA1. This action consolidates the DDR signaling cascade and promotes efficient DNA repair through pathways like non-homologous end-joining and homologous recombination.",
            "biological_consequence": [
              "DNA double-strand break occurs → ATXN3 is recruited to the DSB site via a SUMO-dependent mechanism → ATXN3 counteracts RNF4-mediated ubiquitination of MDC1 → The chromatin dwell time of MDC1 at the DSB is increased → Enhanced recruitment of downstream DDR factors (e.g., RNF8, RNF168, 53BP1, BRCA1) → Efficient signaling and repair of the DNA lesion"
            ],
            "specific_effects": [
              "Loss of ATXN3 leads to a marked decrease in the chromatin dwell time of MDC1 at DSBs.",
              "ATXN3 deficiency impairs the recruitment of RNF8, RNF168, 53BP1, and BRCA1 to sites of DNA damage.",
              "Cells lacking ATXN3 exhibit increased sensitivity to ionizing radiation and PARP inhibitors."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "journal": "The EMBO Journal",
                "year": 2017,
                "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4.",
                "pmid": "28275011"
              }
            ],
            "pmids": [
              "28275011"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is generally correct but can be refined. ATXN3 is recruited to DNA double-strand breaks and interacts with the MRN complex. However, the key mechanistic insight is that ATXN3's deubiquitinase activity counteracts the SUMO-targeted ubiquitin ligase RNF4, which would otherwise promote the removal of the DNA damage checkpoint mediator MDC1 from the damage site. By stabilizing MDC1, ATXN3 indirectly facilitates the recruitment and retention of other DNA damage response factors.",
        "mechanism": "In response to DNA double-strand breaks (DSBs), ATXN3 is recruited to the damage sites in a SUMOylation-dependent manner. There, it interacts with components of the MRN (MRE11-RAD50-NBS1) complex. ATXN3 functions to counteract the activity of the SUMO-targeted ubiquitin ligase RNF4, thereby preventing the premature removal of the checkpoint mediator protein MDC1 from the chromatin.",
        "effect": "By stabilizing MDC1 at DSB sites, ATXN3 ensures the robust recruitment and retention of downstream DNA damage response (DDR) factors, such as RNF8, RNF168, 53BP1, and BRCA1. This action consolidates the DDR signaling cascade and promotes efficient DNA repair through pathways like non-homologous end-joining and homologous recombination.",
        "summary": "ATXN3 activates MRE11A to modulate dna damage response regulation, ultimately affecting efficient signaling and repair of the dna lesion.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "journal": "The EMBO Journal",
            "year": 2017,
            "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4."
          }
        ],
        "arrow_notation": "ATXN3 --activates--> MRE11A:"
      },
      {
        "primary": "HAP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Huntingtin-associated protein 1 (HAP1) interacts with both normal and polyQ-expanded ataxin-3 through the Josephin domain, as shown by immunoprecipitation.",
        "functions": [
          {
            "function": "Binding and Potential Modulation of Cellular Trafficking",
            "arrow": "regulates",
            "cellular_process": "Huntingtin-associated protein 1 (HAP1) physically interacts with ATXN3. This interaction is mediated by the Josephin domain of ATXN3. HAP1 is known to be involved in intracellular trafficking, including the transport of vesicles and organelles along microtubules, by interacting with components of the dynactin complex like p150Glued.",
            "effect_description": "The direct binding of ATXN3 to HAP1 suggests a potential role for ATXN3 in modulating microtubule-based cellular transport. While the precise functional consequence of this interaction on trafficking is not fully elucidated, it is hypothesized that HAP1 could modify the physiological function of normal ATXN3. In the context of Spinocerebellar Ataxia Type 3 (SCA3), the disease-causing polyglutamine-expanded ATXN3 also binds HAP1, which could lead to sequestration of HAP1 into aggregates or disruption of normal transport processes, contributing to neuronal dysfunction.",
            "biological_consequence": [
              "ATXN3 binds to HAP1 via its Josephin domain → Potential modulation of HAP1's function in microtubule-based transport → Regulation of vesicle and organelle trafficking"
            ],
            "specific_effects": [
              "The interaction occurs between the Josephin domain of ATXN3 and HAP1.",
              "Both normal and polyglutamine-expanded mutant ATXN3 interact with HAP1.",
              "This interaction provides a molecular link between the pathologies of Spinocerebellar Ataxia Type 3 and Huntington's disease, where HAP1 is a key interactor of the huntingtin protein."
            ],
            "evidence": [
              {
                "paper_title": "Interaction of ataxin-3 with huntingtin-associated protein 1 through Josephin domain",
                "journal": "Neuroreport",
                "year": 2011,
                "relevant_quote": "The results clearly showed that HAP1/STB interacts with the normal ataxin-3 through Josephin domain and polyglutamine-expanded mutants derived from SCA3 as well. The findings suggest that HAP1/STB could modify the physiological function of normal ataxin-3 and pathogenesis of SCA3 attributable to the mutant ataxin-3.",
                "pmid": "21386698"
              }
            ],
            "pmids": [
              "21386698"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Huntingtin-associated protein 1 (HAP1) physically interacts with ATXN3. This interaction is mediated by the Josephin domain of ATXN3. HAP1 is known to be involved in intracellular trafficking, including the transport of vesicles and organelles along microtubules, by interacting with components of the dynactin complex like p150Glued.",
        "effect": "The direct binding of ATXN3 to HAP1 suggests a potential role for ATXN3 in modulating microtubule-based cellular transport. While the precise functional consequence of this interaction on trafficking is not fully elucidated, it is hypothesized that HAP1 could modify the physiological function of normal ATXN3. In the context of Spinocerebellar Ataxia Type 3 (SCA3), the disease-causing polyglutamine-expanded ATXN3 also binds HAP1, which could lead to sequestration of HAP1 into aggregates or disruption of normal transport processes, contributing to neuronal dysfunction.",
        "summary": "ATXN3 interacts with HAP1 to modulate binding and potential modulation of cellular trafficking, ultimately affecting regulation of vesicle and organelle trafficking.",
        "evidence": [
          {
            "paper_title": "Interaction of ataxin-3 with huntingtin-associated protein 1 through Josephin domain",
            "journal": "Neuroreport",
            "year": 2011,
            "relevant_quote": "The results clearly showed that HAP1/STB interacts with the normal ataxin-3 through Josephin domain and polyglutamine-expanded mutants derived from SCA3 as well. The findings suggest that HAP1/STB could modify the physiological function of normal ataxin-3 and pathogenesis of SCA3 attributable to the mutant ataxin-3."
          }
        ],
        "arrow_notation": "ATXN3 --binds--> HAP1:"
      },
      {
        "primary": "TEAD1",
        "interaction_type": "indirect",
        "upstream_interactor": "YAP1",
        "mediator_chain": [
          "YAP1"
        ],
        "depth": 2,
        "support_summary": "ATXN3 stabilizes YAP1, which then translocates to the nucleus and forms a complex with TEAD family transcription factors (including TEAD1) to drive oncogenic gene expression.",
        "functions": [
          {
            "function": "Indirect Activation of YAP1-TEAD1 Transcriptional Activity",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a deubiquitinase for the transcriptional co-activator YAP1. By removing K48-linked ubiquitin chains, ATXN3 prevents the proteasomal degradation of YAP1, leading to its stabilization and accumulation. Stabilized YAP1 translocates to the nucleus, where it binds to TEAD family transcription factors, including TEAD1. The YAP1-TEAD1 complex then binds to distal enhancers of target genes to drive their transcription.",
            "effect_description": "By stabilizing YAP1, ATXN3 indirectly enhances the formation and transcriptional activity of the oncogenic YAP1-TEAD1 complex. This leads to increased expression of genes involved in cell proliferation, migration, and tumor progression, such as CTGF and CYR61. The transcriptional activity of YAP1 is predominantly mediated through its interaction with TEAD transcription factors at these enhancer regions.",
            "biological_consequence": [
              "ATXN3 binds to the WW domain of YAP1 via its Josephin domain → ATXN3 removes K48-linked ubiquitin chains from YAP1 → YAP1 protein is stabilized and accumulates → YAP1 translocates to the nucleus and forms a complex with TEAD1 → The YAP1-TEAD1 complex binds to distal enhancers of target genes → Increased transcription of oncogenes (e.g., CTGF, CYR61) → Promotion of tumor growth and cell migration"
            ],
            "specific_effects": [
              "ATXN3's deubiquitination of YAP1 prevents its proteasome-mediated degradation.",
              "The interaction is mediated by the Josephin domain of ATXN3 and the WW domain of YAP1.",
              "TEAD transcription factors are the primary mediators of YAP1's chromatin-binding and transcriptional co-activator function.",
              "The YAP1-TEAD1 complex primarily regulates gene expression by binding to distal enhancers, which are often marked by H3K27 acetylation."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
                "journal": "Am J Cancer Res",
                "year": 2023,
                "relevant_quote": "At the molecular level, ATNX3 interacts with the WW domains of YAP1 to protect YAP1 from ubiquitination-mediated degradation. Immunohistology analysis revealed a strong positive correlation between ATXN3 and YAP1 protein expression in human breast and pancreatic cancers. Collectively, our study defines ATXN3 as a previously unknown YAP1 deubiquitinase in tumorigenesis and provides a rationale for ATXN3 targeting in antitumor chemotherapy.",
                "pmid": "37818078"
              },
              {
                "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
                "journal": "Journal of Experimental & Clinical Cancer Research",
                "year": 2023,
                "relevant_quote": "Further mechanistic study revealed that the Josephin domain of ATXN3 interacted with the WW domain of YAP. ATXN3 stabilized YAP protein via inhibiting K48-specific poly-ubiquitination process on YAP protein.",
                "pmid": "37349820"
              },
              {
                "paper_title": "YAP1 Exerts Its Transcriptional Control via TEAD-Mediated Activation of Enhancers",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "We demonstrate that TEAD transcription factors mediate YAP1 chromatin-binding genome-wide, further explaining their dominant role as primary mediators of YAP1-transcriptional activity. Moreover, we show that YAP1 largely exerts its transcriptional control via distal enhancers that are marked by H3K27 acetylation and that YAP1 is necessary for this chromatin mark at bound enhancers and the activity of the associated genes.",
                "pmid": "26295846"
              }
            ],
            "pmids": [
              "37818078",
              "37349820",
              "26295846"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "YAP1",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "YAP1"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction between ATXN3 and TEAD1 is indirect and is mediated by YAP1. ATXN3 does not directly interact with TEAD1 but rather stabilizes the transcriptional co-activator YAP1, which then partners with TEAD family members, including TEAD1, to regulate gene expression.",
        "mechanism": "ATXN3 functions as a deubiquitinase for the transcriptional co-activator YAP1. By removing K48-linked ubiquitin chains, ATXN3 prevents the proteasomal degradation of YAP1, leading to its stabilization and accumulation. Stabilized YAP1 translocates to the nucleus, where it binds to TEAD family transcription factors, including TEAD1. The YAP1-TEAD1 complex then binds to distal enhancers of target genes to drive their transcription.",
        "effect": "By stabilizing YAP1, ATXN3 indirectly enhances the formation and transcriptional activity of the oncogenic YAP1-TEAD1 complex. This leads to increased expression of genes involved in cell proliferation, migration, and tumor progression, such as CTGF and CYR61. The transcriptional activity of YAP1 is predominantly mediated through its interaction with TEAD transcription factors at these enhancer regions.",
        "summary": "ATXN3 activates TEAD1 to modulate indirect activation of yap1-tead1 transcriptional activity, ultimately affecting promotion of tumor growth and cell migration.",
        "evidence": [
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
            "journal": "Am J Cancer Res",
            "year": 2023,
            "relevant_quote": "At the molecular level, ATNX3 interacts with the WW domains of YAP1 to protect YAP1 from ubiquitination-mediated degradation. Immunohistology analysis revealed a strong positive correlation between ATXN3 and YAP1 protein expression in human breast and pancreatic cancers. Collectively, our study defines ATXN3 as a previously unknown YAP1 deubiquitinase in tumorigenesis and provides a rationale for ATXN3 targeting in antitumor chemotherapy."
          },
          {
            "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
            "journal": "Journal of Experimental & Clinical Cancer Research",
            "year": 2023,
            "relevant_quote": "Further mechanistic study revealed that the Josephin domain of ATXN3 interacted with the WW domain of YAP. ATXN3 stabilized YAP protein via inhibiting K48-specific poly-ubiquitination process on YAP protein."
          },
          {
            "paper_title": "YAP1 Exerts Its Transcriptional Control via TEAD-Mediated Activation of Enhancers",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "We demonstrate that TEAD transcription factors mediate YAP1 chromatin-binding genome-wide, further explaining their dominant role as primary mediators of YAP1-transcriptional activity. Moreover, we show that YAP1 largely exerts its transcriptional control via distal enhancers that are marked by H3K27 acetylation and that YAP1 is necessary for this chromatin mark at bound enhancers and the activity of the associated genes."
          }
        ],
        "arrow_notation": "YAP1 --activates--> TEAD1:"
      }
    ]
  }
}